#Region Internal

// @unit-test
Procedure InfoOnlyEvent(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация1.Информация2.Информация3';en = 'Webhooks.Информация1.Информация2.Информация3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	// when
	Logging.Info( "Информация1.Информация2.Информация3", "обушки-воробушки");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");

EndProcedure

// @unit-test
Procedure WarnOnlyEvent(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение1.Предупреждение2.Предупреждение3';en = 'Webhooks.Предупреждение1.Предупреждение2.Предупреждение3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение"); 
	// when
	Logging.Warn( "Предупреждение1.Предупреждение2.Предупреждение3", "обушки-воробушки2");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorOnlyEvent(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка1.Ошибка2.Ошибка3';en = 'Webhooks.Ошибка1.Ошибка2.Ошибка3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	// when
	Logging.Error( "Ошибка1.Ошибка2.Ошибка3", "обушки-воробушки3");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	
EndProcedure

// @unit-test
Procedure InfoEventWithObject(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация11.Информация22.Информация33';en = 'Webhooks.Информация11.Информация22.Информация33'");
	
	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Info( "Информация11.Информация22.Информация33", "обушки-воробушки", Webhook.Ref );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Информация");
	
EndProcedure

// @unit-test
Procedure WarnEventWithObject(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение11.Предупреждение22.Предупреждение33';en = 'Webhooks.Предупреждение11.Предупреждение22.Предупреждение33'");

	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Warn( "Предупреждение11.Предупреждение22.Предупреждение33", "обушки-воробушки2", Webhook.Ref );
	// then	
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorEventWithObject(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка11.Ошибка22.Ошибка33';en = 'Webhooks.Ошибка11.Ошибка22.Ошибка33'");
	
	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Error( "Ошибка11.Ошибка22.Ошибка33", "обушки-воробушки3", Webhook.Ref );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Ошибка");
	
EndProcedure

// @unit-test:dev
Procedure InfoEventWithObjectAndHTTPResponse200(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация111.Информация222.Информация333.200';en = 'Webhooks.Информация111.Информация222.Информация333.200'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	Response = Новый HTTPСервисОтвет(200);
	// when
	Logging.Info( "Информация111.Информация222.Информация333", "обушки-воробушки", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьВхождение(Результат[0].Comment, """type"": ""info""", "Информация");
	Фреймворк.ПроверитьВхождение(Результат[0].Comment, """обушки-воробушки""", "Информация");

EndProcedure

Procedure est
Процедура СобытиеПредупреждениеСОбъектомИHTTPСервисОтвет200(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение111.Предупреждение222.Предупреждение333.200';en = 'Webhooks.Предупреждение111.Предупреждение222.Предупреждение333.200'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	//LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(200));
	// when
	Logging.Warn( "Предупреждение111.Предупреждение222.Предупреждение333", "обушки-воробушки2", , Новый HTTPСервисОтвет(200) );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
//	Эталон = "{
//		| ""type"": ""warning"",
//		| ""message"": ""обушки-воробушки2""
//		|}";	
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 200, "Предупреждение");
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку(), Эталон, "Предупреждение");

EndProcedure

Procedure est
Процедура СобытиеОшибкаСОбъектомИHTTPСервисОтвет200(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка111.Ошибка222.Ошибка333.200';en = 'Webhooks.Ошибка111.Ошибка222.Ошибка333.200'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
//	LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(200));
	// when
	Logging.Error( "Ошибка111.Ошибка222.Ошибка333", "обушки-воробушки3", , Новый HTTPСервисОтвет(200) );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
//	Эталон = "{
//		| ""type"": ""error"",
//		| ""message"": ""обушки-воробушки3""
//		|}";
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 200, "Ошибка");
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку(), Эталон, "Ошибка");
	
EndProcedure

Procedure est
Процедура СобытиеИнформацияСОбъектомИHTTPСервисОтвет400(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация1111.Информация2222.Информация3333.400';en = 'Webhooks.Информация1111.Информация2222.Информация3333.400'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
//	LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(400));
	// when
	Logging.Info( "Информация1111.Информация2222.Информация3333", "обушки-воробушки", , Новый HTTPСервисОтвет(400) );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 400, "Информация");
//	Фреймворк.ПроверитьИстину(ПустаяСтрока(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку()), "Информация");

EndProcedure

Procedure est
Процедура СобытиеПредупреждениеСОбъектомИHTTPСервисОтвет400(Фреймворк) Экспорт

	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение1111.Предупреждение2222.Предупреждение3333.400';en = 'Webhooks.Предупреждение1111.Предупреждение2222.Предупреждение3333.400'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	//LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(400));
	// when
	Logging.Warn( "Предупреждение1111.Предупреждение2222.Предупреждение3333", "обушки-воробушки2", , Новый HTTPСервисОтвет(400) );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 400, "Предупреждение");
//	Фреймворк.ПроверитьИстину(ПустаяСтрока(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку()), "Предупреждение");

EndProcedure

Procedure est
Процедура СобытиеОшибкаСОбъектомИHTTPСервисОтвет400(Фреймворк) Экспорт
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка1111.Ошибка2222.Ошибка3333.400';en = 'Webhooks.Ошибка1111.Ошибка2222.Ошибка3333.400'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	//LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(400));
	// when
	Logging.Error( "Ошибка1111.Ошибка2222.Ошибка3333", "обушки-воробушки3", , Новый HTTPСервисОтвет(400) );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 400, "Ошибка");
//	Фреймворк.ПроверитьИстину(ПустаяСтрока(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку()), "Ошибка");

EndProcedure

//Procedure est
//Процедура СобытиеИнформацияHTTPСервисОтветТелоОтвета200(Фреймворк) Экспорт
//
//	// given
//	//LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(200));
//	// when
//	Logging.Info( "Информация200.Информация200.Информация200", "обушки-воробушки", , Новый HTTPСервисОтвет(200) );
//	// then		
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 200, "Информация200");
//	ТелоОтвета = LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку();
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация200");
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки", "Информация200");
//	
//EndProcedure	

//Procedure est
//Процедура СобытиеИнформацияHTTPСервисОтветТелоОтвета400(Фреймворк) Экспорт
//	
//	// given
////	LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(400));
//	// when
//	Logging.Info( "Информация400.Информация400.Информация400", "обушки-воробушки2", , Новый HTTPСервисОтвет(400) );
//	// then			
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 400, "Информация400");
//	Фреймворк.ПроверитьИстину(ПустаяСтрока(LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку()), "Информация400");
//
//EndProcedure	

//Procedure est
//Процедура СобытиеИнформацияHTTPСервисОтветТелоОтвета403(Фреймворк) Экспорт
//
//	// given
////	LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(403));
//	// when
//	Logging.Info( "Информация403.Информация403.Информация403", "обушки-воробушки3", , Новый HTTPСервисОтвет(403) );
//	// then		
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 403, "Информация403");
//	ТелоОтвета = LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку();
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация403");
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки3", "Информация403");
//
//EndProcedure	

//Procedure est
//Процедура СобытиеИнформацияHTTPСервисОтветТелоОтвета423(Фреймворк) Экспорт
//	
//	// given
////	LoggingOptions = Logging.ДополнительныеПараметры( , Новый HTTPСервисОтвет(423));
//	// when
//	Logging.Info( "Информация423.Информация423.Информация423", "обушки-воробушки4", , Новый HTTPСервисОтвет(423) );
//	// then		
//	Фреймворк.ПроверитьРавенство(LoggingOptions.HTTPОтвет.КодСостояния, 423, "Информация423");
//	ТелоОтвета = LoggingOptions.HTTPОтвет.ПолучитьТелоКакСтроку();
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация423");
//	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки4", "Информация423");
//	
//EndProcedure

// @unit-test
// Параметры:
Procedure орк - ФреймворкТестирования - Фреймворк тестирования
Процедура ДополнитьСообщениеПрефиксом(Фреймворк) Экспорт
	
	// given
	Префикс = "Префикс";
	Сообщение = "Текст сообщения.";
	// when
	Результат = Logging.AddPrefix(Сообщение, Префикс);
	// then
	Фреймворк.ПроверитьРавенство(Результат, "[ Префикс ]: Текст сообщения.");
	
EndProcedure	

#EndRegion

#Region Private
Procedure 
Процедура УдалитьВсеОбработчикиСобытий()
	
	TestsCommonUseServer.СправочникиУдалитьВсеДанные("Webhooks");

EndProcedure

Функция ОтборЖурналаРегистрации(Событие, Уровень = "Информация")
	
	Возврат TestsCommonUseServer.ОтборЖурналаРегистрации(Событие, Уровень);
	
КонецФункции

Функция СобытияЖурналаРегистрации(Отбор, Секунд = 2)
	
	Возврат TestsCommonUseServer.СобытияЖурналаРегистрации(Отбор, Секунд);
	
КонецФункции

#EndRegion
