#Область ПрограммныйИнтерфейс

Процедура ДополнитьТелоЗапросаНастройкамиМаршрутизации( ДанныеТелаЗапроса, Знач ДанныеДляОтправки ) Экспорт
	
	ИмяФайла = НастройкаСервисов.ТекущиеНастройки().ИмяФайлаНастроекМаршрутизации;
	Коммиты = ДанныеТелаЗапроса.Получить("commits");
	
	Для каждого Коммит Из Коммиты Цикл
		
		Идентификатор = Коммит.Получить("id");
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("CommitSHA", Идентификатор );
		ПараметрыОтбора.Вставить("Операция", "");
		ПараметрыОтбора.Вставить("ПолноеИмяФайла", ИмяФайла );
		ПараметрыОтбора.Вставить("ОписаниеОшибки", "");
		
		НайденныеСтроки = ДанныеДляОтправки.НайтиСтроки(ПараметрыОтбора);
		
		Если ( НЕ ЗначениеЗаполнено(НайденныеСтроки) ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Коммит.Вставить("settings", ПолучитьСтрокуИзДвоичныхДанных(НайденныеСтроки[0].ДвоичныеДанные,  КодировкаТекста.UTF8 ) );
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти