// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере( Отказ, СтандартнаяОбработка )
	
	Если ( ПустаяСтрока(Параметры.Данные) ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить( "ПереносСтрок", ПереносСтрокJSON.Авто );
	ПараметрыЗаписи.Вставить( "СимволыОтступа", "  " );
		
	Редактор = КоннекторHTTP.ОбъектВJson( КоннекторHTTP.JsonВОбъект(Параметры.Данные), , ПараметрыЗаписи );
	
КонецПроцедуры

#КонецОбласти
