#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ПолучитьСтатус")
	;
	
КонецПроцедуры

Процедура ПолучитьСтатус() Экспорт
	
	// given
	Тест = Заглушка();
	
	// when
	Результат = ПолучателиВызовСервера.ПолучитьСтатус(Тест);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.ИмеетДлину(2)
		.Свойство("КодСостояния").Равно(500)
		.Свойство("ТелоОтвета").Содержит("or missing URL");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Заглушка()
	
	Результат = Новый Структура();
	Результат.Вставить("Адрес", "");
	Результат.Вставить("Пользователь", ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока());
	Результат.Вставить("Пароль", ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока());
	Результат.Вставить("Таймаут", ОМ_Тесты.ЮТест().Данные().СлучайноеЧисло(1, 60));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
