#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("СоздатьИнформациюОбОшибке")
		.ДобавитьТест("JsonВОбъект")
		.ДобавитьТест("JsonВОбъектОтметкаВремениИмеетФорматДаты");
	
КонецПроцедуры

Процедура СоздатьИнформациюОбОшибке() Экспорт

	// given
	Сообщение = "новая ошибка";

	// when
	Результат = ОбщегоНазначенияВызовСервера.СоздатьИнформациюОбОшибке(Сообщение);

	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("ИнформацияОбОшибке")
		.Свойство("Описание").Равно(Сообщение);

КонецПроцедуры

Процедура JsonВОбъект() Экспорт
	
	// given
	JSON = "{}";

	// when
	Результат = ОбщегоНазначенияВызовСервера.JsonВОбъект(JSON);

	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Соответствие");
	
КонецПроцедуры

Процедура JsonВОбъектОтметкаВремениИмеетФорматДаты() Экспорт
	
	// given
	JSON = ОМ_ТестовыеДанные.ПолучитьТело(ОМ_Тесты.ЮТНастройкиВыполнения().КаталогПроекта() + "/test/requests/push-repo1-req1.json");

	// when
	Результат = ОбщегоНазначенияВызовСервера.JsonВОбъект(JSON);

	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Соответствие")
		.Свойство("commits[0].timestamp").ИмеетТип("Дата");
	
КонецПроцедуры

#КонецОбласти
