
&Вместо("ЗаписатьДанные")
Процедура Мок_ЗаписатьДанные(Знач Обработчик, Знач Идентификатор, Знач Данные, Знач Комментарий, Знач Дата)

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор, Данные, Комментарий, Дата);
	
	ПрерватьВыполнение = Ложь;
	ОМ_Тесты.Мокито().АнализВызова(РегистрыСведений.ВнешниеЗапросы, "ЗаписатьДанные", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Обработчик, Идентификатор, Данные, Комментарий, Дата);
	КонецЕсли;

КонецПроцедуры

&Вместо("НайтиДанные")
Функция Мок_НайтиДанные(Знач Обработчик, Знач Идентификатор) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(Регистрысведений.ВнешниеЗапросы, "НайтиДанные", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Обработчик, Идентификатор);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
