#Область ПрограммныйИнтерфейс

// Поиск обработчика событий по секретному ключу (token).
// 
// Параметры:
// 	Token - Строка - секретный ключ (token);
// 	
// Возвращаемое значение:
// 	СправочникСсылка.ОбработчикиСобытий -  ссылка на элемент справочника  "ОбработчикиСобытий";
// 											если не найден, то - пустая ссылка;
//
// @UnitTest
//
Функция НайтиПоСекретномуКлючу( Знач Token ) Экспорт
	
	Возврат Справочники.ОбработчикиСобытий.НайтиПоСекретномуКлючу( Token ); 
	
КонецФункции

#КонецОбласти