#Область СлужебныйПрограммныйИнтерфейс

Функция ЮТест() Экспорт
	
	Возврат ОбщийМодуль("ЮТест");
	
КонецФункции

Функция ЮТЗапросы() Экспорт
	
	Возврат ОбщийМодуль("ЮТЗапросы");
	
КонецФункции

Функция ЮТЗависимости() Экспорт
	
	Возврат ОбщийМодуль("ЮТЗависимости");
	
КонецФункции

Функция ЮТКоллекции() Экспорт
	
	Возврат ОбщийМодуль("ЮТКоллекции");
	
КонецФункции

Функция ЮТНастройкиВыполнения() Экспорт
	
	Возврат ОбщийМодуль("ЮТНастройкиВыполнения");
	
КонецФункции

Функция ЮТОбщий() Экспорт
	
	Возврат ОбщийМодуль("ЮТОбщий");
	
КонецФункции

Функция Мокито() Экспорт
	
	Возврат ОбщийМодуль("Мокито");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщийМодуль(Имя)

	#Если Сервер Тогда
		УстановитьБезопасныйРежим(Истина);
	#КонецЕсли

	Возврат Вычислить(Имя);

КонецФункции

#КонецОбласти
