// @strict-types

#Область ПрограммныйИнтерфейс

// ПолучитьКраткийИдентификатор возвращает краткий идентификатор на основе полученного идентификатора.
// 
// Параметры:
//   Идентификатор - ОпределяемыйТип.ИдентификаторКоммита - исходный идентификатор.
//
// Возвращаемое значение:
//   ОпределяемыйТип.КраткийИдентификаторКоммита - краткий идентификатор.
//
Функция ПолучитьКраткийИдентификатор( Знач Идентификатор ) Экспорт
	
	Возврат Лев( Идентификатор, ПараметрыСеанса.ДлинаХэшаКоммита );

КонецФункции

#КонецОбласти
