Здесь ();
Нажать ("!ФормаЗаписать");
Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
	Стоп ( "Должна быть ошибка пустого значения в поле" );
КонецЕсли;

Установить ( "!Наименование", "любое значение" );

Нажать ("!ФормаЗаписать");
Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
	Стоп ( "Должна быть ошибка пустого значения в поле" );
КонецЕсли;

Установить ( "!СекретныйТокен", "любое значение" );

Нажать ( "!ФормаЗаписать" );
Если ( НайтиСообщения ( "Поле*" ).Количество () > 0 ) Тогда
	Стоп ( "Не должно быть ошибок пустого значения в поле" );
КонецЕсли;

Очистить ("!Наименование" );
Очистить ("!СекретныйТокен" );