//Подключить ();
//ЗакрытьВсе ();

// Вводим новый документ
Коммандос ( "e1cib/data/Справочник.ОбработчикиСобытий" );

Вызвать ( "Справочники.ОбработчикиСобытий.Создать.ПроверитьОбязательностьЗаполнения");

Здесь ();

//Нажать ("!ФормаЗаписатьИЗакрыть");
//Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
//	Стоп ( "Должна быть ошибка пустого значения в поле" );
//КонецЕсли;

Установить ( "!Наименование", _.Наименование );
Установить ( "!СекретныйТокен", _.СекретныйТокен );

Нажать ( "!ФормаЗаписатьИЗакрыть" );
//Если ( НайтиСообщения ( "Поле*" ).Количество () > 0 ) Тогда
//	Стоп ( "Не должно быть ошибок пустого значения в поле" );
//КонецЕсли;