#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_ДополнитьКоллекциюТекстомИзПотока(Фреймворк) Экспорт
	
	Поток = Новый ПотокВПамяти();
	ЗаписьТекста = Новый ЗаписьТекста(Поток);
	Значение = "Туточки текст потока";
	ЗаписьТекста.Записать(Значение);
   	ЗаписьТекста.Закрыть();

	Коллекция = Новый Структура("Ключ1", "Значение1");
	ОбщегоНазначения.ДополнитьКоллекциюТекстомИзПотока(Поток, "Ключ2", Коллекция);
   	Поток.Закрыть();

   	Фреймворк.ПроверитьРавенство( Значение, Коллекция.Ключ2 );

КонецПроцедуры







// TODO актуальные методы??

// @unit-test
Процедура Тест_МетодьПотокВКоллекциюКакJSON(Фреймворк) Экспорт
	
	Поток = Новый ПотокВПамяти();
	ЗаписьТекста = Новый ЗаписьТекста(Поток);
	ЭталонJSON = "{
				 |""Сообщение"": ""ТекстСообщения""
				 |}";
	ЗаписьТекста.Записать(ЭталонJSON);
   	ЗаписьТекста.Закрыть();

	Коллекция1 = Неопределено;
	ОбщегоНазначения.ПотокВКоллекциюКакJSON(Поток, Истина, Истина, Коллекция1);
	
	Коллекция2 = Неопределено;
	ОбщегоНазначения.ПотокВКоллекциюКакJSON(Поток, Ложь, Истина, Коллекция2);
	
	Коллекция3 = Неопределено;
	ОбщегоНазначения.ПотокВКоллекциюКакJSON(Поток, Ложь, Ложь, Коллекция3);

   	Поток.Закрыть();

   	Фреймворк.ПроверитьТип( Коллекция1, "Соответствие" );
   	Фреймворк.ПроверитьТип( Коллекция2, "Структура" );
   	Фреймворк.ПроверитьРавенство( Коллекция1.Получить("json"), ЭталонJSON );
   	Фреймворк.ПроверитьРавенство( Коллекция2.json, ЭталонJSON );
   	Фреймворк.ПроверитьЛожь( Коллекция3.Свойство("json") );
	
КонецПроцедуры

// TODO не используется?
Функция РезультатЗапросаMock(Знач URL, Знач Token, Знач ПутьКТелуЗапроса, Знач КаталогПроекта) Экспорт
	
	ПараметрыСоединения = РазобратьURL(URL);
	АдресСервиса = СтрШаблон("%1/webhooks/epf/updates", ПараметрыСоединения.Путь);
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыСоединения.Сервер);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Gitlab-Event", "Push Hook");
	Заголовки.Вставить("X-Gitlab-Token", Token);

	HTTPЗапрос = Новый HTTPЗапрос(АдресСервиса, Заголовки);
	
	ПолныйПуть = ПолучитьПолныйПуть(ПутьКТелуЗапроса, КаталогПроекта);
	HTTPЗапрос.УстановитьИмяФайлаТела(ПолныйПуть);
	
	Возврат HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
КонецФункции

//Объединяем относительные пути файловой системы в один
// при передаче Путь = ../test/file.txt и ПутьОтносительно=c:\work\ возращаем c:\test\file.txt
// при передаче Путь = ./test/file.txt и ПутьОтносительно=c:\work\ возращаем c:\work\test\file.txt
// если в начале нет точки, считаем этот путь полным. 
Функция ПолучитьПолныйПуть(Знач Путь, Знач ПутьОтносительно) Экспорт
	Перем Результат;
	Результат = Путь;
	Если Лев(СокрЛП(Путь), 1) = "." Тогда 
		ФайлОбработки = Новый Файл(ПутьОтносительно);
		КаталогОбработки = ДополнитьСлешВПуть(ФайлОбработки.ПолноеИмя);
		ФайлПути = Новый Файл(КаталогОбработки + Путь);
		
		Результат = ФайлПути.ПолноеИмя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФунции

Функция РазобратьURL(URL)
	Возврат КоннекторHTTP.РазобратьURL(URL);
КонецФункции

// Функция ДополнитьСлешВПуть
//
// Параметры:
// ИмяКаталога
//
// Описание:
// Функция дополняет и возвращает слеш в путь в конец строки, если он отсутствует
//
Функция ДополнитьСлешВПуть(Знач Каталог) Экспорт
	Разделитель = "\";
	
	Если ПустаяСтрока(Каталог) Тогда
		Возврат Каталог;
	КонецЕсли;
	
	Если Прав(Каталог, 1) <> Разделитель Тогда
		Каталог = Каталог + Разделитель;
	КонецЕсли;
	
	Возврат Каталог;
КонецФункции

#КонецОбласти
