// BSLLS-выкл.
#Область СлужебныйПрограммныйИнтерфейс

Функция WebhooksPOST(URL, СекретныйКлюч, ТестовыеДанные = Неопределено, Адрес = "") Экспорт

	JSON = Неопределено;
	Если НЕ ПустаяСтрока(Адрес) Тогда
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		JSON = ПолучитьСтрокуИзДвоичныхДанных(Данные, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Gitlab-Event", "Push Hook");
	Заголовки.Вставить("X-Gitlab-Token", СекретныйКлюч);

	Заголовки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТестовыеДанные, "Заголовки", Заголовки);
	JSON = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТестовыеДанные, "JSON", JSON);
	
	Дополнительно = Новый Структура();
	Дополнительно.Вставить("Заголовки", Заголовки);
	Дополнительно.Вставить("Таймаут", 5);
	
	Результат = КоннекторHTTP.Post(URL, JSON, Дополнительно);
	
	Возврат Результат;
	
КонецФункции

#Область ВспомогательныеПроцедурыИФункции

Функция КоннекторHTTPGet(Знач URL) Экспорт

	Возврат КоннекторHTTP.Get(URL);

КонецФункции

Функция КоннекторHTTPPost(Знач URL, Знач Данные, Знач ДополнительныеПараметры) Экспорт

	Возврат КоннекторHTTP.Post(URL, Данные, ДополнительныеПараметры);

КонецФункции

Функция ДобавитьОбработчикСобытий(Знач Наименование = "", Знач СекретныйКлюч = "") Экспорт
	
	НовыйЭлемент = Справочники.ОбработчикиСобытий.СоздатьЭлемент();
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.СекретныйКлюч = СекретныйКлюч;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура УдалитьЭлементыСправочникаОбработчикиСобытий(Знач СекретныйКлюч) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
		|	ОбработчикиСобытий.Ссылка
		|ИЗ
		|	Справочник.ОбработчикиСобытий КАК ОбработчикиСобытий
		|ГДЕ
		|	ОбработчикиСобытий.СекретныйКлюч = &СекретныйКлюч";
	
	Запрос.УстановитьПараметр("СекретныйКлюч", СекретныйКлюч);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Удалить();		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти