// BSLLS-выкл.
#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:dev
Процедура СтруктураОтвета(Фреймворк) Экспорт

	// when
	Результат = HTTPСервисы.СтруктураОтвета();
	// then
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 2);
	Фреймворк.ПроверитьИстину(Результат.Свойство("type"));
	Фреймворк.ПроверитьИстину(Результат.Свойство("message"));
	
КонецПроцедуры

//@unit-test:dev
Процедура ОписаниеНеСуществующегоСервиса(Фреймворк) Экспорт

	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "фэйк";
	// when
	ОписаниеСервиса = HTTPСервисы.ОписаниеСервиса(URL);
	// then
	Фреймворк.ПроверитьРавенство(ОписаниеСервиса, Неопределено);

КонецПроцедуры

//@unit-test:dev
Процедура ОписаниеСуществующегоСервиса(Фреймворк) Экспорт

	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "gitlab";
	// when
	ОписаниеСервиса = HTTPСервисы.ОписаниеСервиса(URL);
	// then
	ОписаниеСервиса = HTTPСервисы.ОписаниеСервиса("gitlab");
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("enabled"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("templates"));
	Фреймворк.ПроверитьРавенство(ОписаниеСервиса.templates.Количество(), 2);
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("template"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("methods"));
	Фреймворк.ПроверитьРавенство(ОписаниеСервиса.templates[0].methods.Количество(), 1);
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("method"));

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURLBadURL(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "йохохо";
	// when
	Попытка
		Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
		ВызватьИсключение НСтр("ru = 'Должна быть ошибка при вызове метода, но это не так.'");
	Исключение
		// then
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Фреймворк.ПроверитьВхождение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке),
		 							"Couldn't resolve host name");
	КонецПопытки;		

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURLПустойURL(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "";
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	//then
	Фреймворк.ПроверитьТип(Результат, "Неопределено", "Пустой адрес");

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURLНеверныйТип(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = Новый Массив;
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	//then
	Фреймворк.ПроверитьТип(Результат, "Неопределено", "Неверный тип");

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURLНеверноеИмяСервиса(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "йохохо";
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	//then
	Фреймворк.ПроверитьТип(Результат, "Неопределено", "Ошибка в имени сервиса");

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURLОшибкаПреобразования(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "http://www.example.com";
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	//then
	Фреймворк.ПроверитьТип(Результат, "Неопределено", "Ошибка преобразования тела ответа в коллекцию");

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURL404NotFound(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	URL = "http://www.example.com/NotFound";
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	//then
	Фреймворк.ПроверитьТип(Результат, "Неопределено", "Страница не найдена");

КонецПроцедуры

// @unit-test:dev
Процедура ОписаниеСервисаURL(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/services";
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	// when
	Результат = HTTPСервисы.ОписаниеСервисаURL(URL);
	// then
	Фреймворк.ПроверитьИстину(Результат.Свойство("Ответ"));
	Фреймворк.ПроверитьТип(Результат.Ответ, "Структура", "Веб-сервис не отвечает.");
	Фреймворк.ПроверитьЗаполненность(Результат.Ответ, "Ответ веб-сервиса не должен быть пустым.");
	Фреймворк.ПроверитьРавенство(Результат.Ответ.КодСостояния, 200, "Веб-сервис отвечает, но с ошибкой.");
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 3);
	Фреймворк.ПроверитьИстину(Результат.Свойство("Ответ"));
	Фреймворк.ПроверитьИстину(Результат.Свойство("Данные"));
	Фреймворк.ПроверитьИстину(Результат.Свойство("json"));
	Фреймворк.ПроверитьВхождение(Результат.json, """version""");
	Фреймворк.ПроверитьВхождение(Результат.json, """services""");
	Фреймворк.ПроверитьВхождение(Результат.json, """enabled""");
	Фреймворк.ПроверитьВхождение(Результат.json, """templates""");
	Фреймворк.ПроверитьВхождение(Результат.json, """template""");
	Фреймворк.ПроверитьВхождение(Результат.json, """methods""");
	Фреймворк.ПроверитьВхождение(Результат.json, """method""");	

КонецПроцедуры

// @unit-test:fast
Процедура ServicesGET(Фреймворк) Экспорт
	
	// given
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/services";
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	// when
	Результат = КоннекторHTTP.Get(URL);
	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """version""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """services""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """enabled""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """templates""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """template""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """methods""");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """method""");	

КонецПроцедуры

// @unit-test:fast
Процедура WebhooksPOST(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	//ЭталонWebHookGitLab = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ЭталонWebHookGitLab");
	ЭталонWebHookGitLab = "/home/usr1cv8/test/post-from-gitlab.json";
	Текст = Новый ЧтениеТекста(ЭталонWebHookGitLab, КодировкаТекста.UTF8);
	JSON = Текст.Прочитать();

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "Запрос обработан.");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST403Forbidden(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Ложь);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	ФэйковыйСекретныйКлюч = "ФэйковыйСекретныйКлюч";
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{}";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Gitlab-Event", "Push Hook");
	Заголовки.Вставить("X-Gitlab-Token", ФэйковыйСекретныйКлюч);
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("Заголовки", Заголовки);
	Дополнительно.Вставить("Таймаут", 5);

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, Дополнительно);
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	
	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 403);
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "Секретный ключ не найден");
	
КонецПроцедуры


// @unit-test:dev
Процедура WebhooksPOST423Locked(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Ложь);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{}";
	
	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 423);
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "Отключен функционал загрузки из внешнего хранилища.");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestXGitlabEvent(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{}";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Gitlab-Event", "Push Hook2");
	Заголовки.Вставить("X-Gitlab-Token", СекретныйКлюч);
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("Заголовки", Заголовки);
	Дополнительно.Вставить("Таймаут", 5);

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, Дополнительно);
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 Push Hook2");
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 Push Hook2");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestBadURLEpf(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf3/push";
	JSON = "{}";

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 BadURLEpf");
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 BadURLEpf");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestBadURLPush(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push3";
	JSON = "{}";
	
	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 BadURLPush");
	ТелоОтвета = HTTPConnector.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 BadURLPush");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestCheckoutSHA(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{
	   |  ""object_kind"": ""push"",
	   |  ""project_id"": 178,
	   |  ""project"": {
	   |    ""id"": 178,
	   |    ""name"": ""TestEpf"",
	   |    ""web_url"": ""http://git.a/a.strizhachuk/testepf"",
	   |    ""description"": """"
	   |  },
	   |  ""commits"": [
	   |    {
	   |      ""id"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
	   |      ""message"": ""Merge branch ''ttt'' into ''master''\n\nTtt\n\nSee merge request a.strizhachuk/testepf!2""
	   |    },
	   |    {
	   |      ""id"": ""bb8c1e02e420afffe601ada9f1171991d0404e68"",
	   |      ""message"": ""test\n""
	   |    },
	   |    {
	   |      ""id"": ""2fb9499926026288d1e9b9c6586338fff4ec996b"",
	   |      ""message"": ""test\n""
	   |    }
	   |  ],
	   |  ""total_commits_count"": 3
	   |  }
	   |}";

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 checkout_sha");
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 checkout_sha");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestProject(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{
		   |  ""object_kind"": ""push"",
		   |  ""checkout_sha"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |  ""project_id"": 178,
		   |  ""commits"": [
		   |    {
		   |      ""id"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |      ""message"": ""Merge branch ''ttt'' into ''master''\n\nTtt\n\nSee merge request a.strizhachuk/testepf!2""
		   |    },
		   |    {
		   |      ""id"": ""bb8c1e02e420afffe601ada9f1171991d0404e68"",
		   |      ""message"": ""test\n""
		   |    },
		   |    {
		   |      ""id"": ""2fb9499926026288d1e9b9c6586338fff4ec996b"",
		   |      ""message"": ""test\n""
		   |    }
		   |  ],
		   |  ""total_commits_count"": 3
		   |  }
		   |}";

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 project");
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 project");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestProjectWebURL(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{
		   |  ""object_kind"": ""push"",
		   |  ""checkout_sha"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |  ""project_id"": 178,
		   |  ""project"": {
		   |    ""id"": 178,
		   |    ""name"": ""TestEpf"",
		   |    ""description"": """"
		   |  },
		   |  ""commits"": [
		   |    {
		   |      ""id"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |      ""message"": ""Merge branch ''ttt'' into ''master''\n\nTtt\n\nSee merge request a.strizhachuk/testepf!2""
		   |    },
		   |    {
		   |      ""id"": ""bb8c1e02e420afffe601ada9f1171991d0404e68"",
		   |      ""message"": ""test\n""
		   |    },
		   |    {
		   |      ""id"": ""2fb9499926026288d1e9b9c6586338fff4ec996b"",
		   |      ""message"": ""test\n""
		   |    }
		   |  ],
		   |  ""total_commits_count"": 3
		   |  }
		   |}";
	
	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 project/web_url");
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 project/web_url");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestCommits(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{
		   |  ""object_kind"": ""push"",
		   |  ""checkout_sha"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |  ""project_id"": 178,
		   |  ""project"": {
		   |    ""id"": 178,
		   |    ""name"": ""TestEpf"",
		   |    ""web_url"": ""http://git.a/a.strizhachuk/testepf"",
		   |    ""description"": """"
		   |  },
		   |  ""total_commits_count"": 3
		   |  }
		   |}";
	
	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 commits");
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 commits");

КонецПроцедуры

// @unit-test:dev
Процедура WebhooksPOST400BadRequestCommitsId(Фреймворк) Экспорт

	// given
	СекретныйКлюч = "блаблаблаюниттест";
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);
	ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	Константы.ОбрабатыватьЗапросыВнешнегоХранилища.Установить(Истина);
	
	// https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	// URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> АдресСервисаИБРаспределителя");
	// Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	URL = "http://transmitter/api/hs/gitlab";
	URL = URL + "/webhooks/epf/push";
	JSON = "{
		   |  ""object_kind"": ""push"",
		   |  ""checkout_sha"": ""87fc6b2782f1bcadce980cb52941e2bd90974c0f"",
		   |  ""project_id"": 178,
		   |  ""project"": {
		   |    ""id"": 178,
		   |    ""name"": ""TestEpf"",
		   |    ""web_url"": ""http://git.a/a.strizhachuk/testepf"",
		   |    ""description"": """"
		   |  },
		   |  ""commits"": [
		   |    {
		   |      ""message"": ""Merge branch ''ttt'' into ''master''\n\nTtt\n\nSee merge request a.strizhachuk/testepf!2""
		   |    },
		   |    {
		   |      ""id"": ""bb8c1e02e420afffe601ada9f1171991d0404e68"",
		   |      ""message"": ""test\n""
		   |    },
		   |    {
		   |      ""id"": ""2fb9499926026288d1e9b9c6586338fff4ec996b"",
		   |      ""message"": ""test\n""
		   |    }
		   |  ],
		   |  ""total_commits_count"": 3
		   |  }
		   |}";

	// when
	Результат = КоннекторHTTP.Post(URL, JSON, ДополнительныеПараметрыУспешногоЗапроса());
	УдалитьЭлементыСправочникаОбработчикиСобытий(СекретныйКлюч);

	// then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 400, "400 commits/id");
	ТелоОтвета = Тест_ОбщийМодульСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ТелоОтвета), "400 commits/id");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДополнительныеПараметрыУспешногоЗапроса()
	
	СекретныйКлюч = "блаблаблаюниттест";

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Gitlab-Event", "Push Hook");
	Заголовки.Вставить("X-Gitlab-Token", СекретныйКлюч);
	Дополнительно = Новый Структура;
	Дополнительно.Вставить("Заголовки", Заголовки);
	Дополнительно.Вставить("Таймаут", 5);
	
	Возврат Дополнительно;
	 
КонецФункции

Функция ДобавитьОбработчикСобытий(Знач Наименование = "", Знач СекретныйКлюч = "")
	
	НовыйЭлемент = Справочники.ОбработчикиСобытий.СоздатьЭлемент();
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.СекретныйКлюч = СекретныйКлюч;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура УдалитьЭлементыСправочникаОбработчикиСобытий(Знач СекретныйКлюч)
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
		|	ОбработчикиСобытий.Ссылка
		|ИЗ
		|	Справочник.ОбработчикиСобытий КАК ОбработчикиСобытий
		|ГДЕ
		|	ОбработчикиСобытий.СекретныйКлюч = &СекретныйКлюч";
	
	Запрос.УстановитьПараметр("СекретныйКлюч", СекретныйКлюч);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Удалить();		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти