#Область ОбработчикиСобытий

Процедура ПередЗаписью( Отказ )
	
	Var ОбработчикиСобытийПоКлючу;
	
	Если ( Отказ ИЛИ ОбменДанными.Загрузка ) Тогда
		
		Возврат;

	КонецЕсли;
	
	ОбработчикиСобытийПоКлючу = Справочники.ОбработчикиСобытий.НайтиПоСекретномуКлючу( ЭтотОбъект.SecretToken );
	
	Для Каждого ОбработчикСобытий Из ОбработчикиСобытийПоКлючу Цикл
		
		Если ( ОбработчикСобытий = ЭтотОбъект.Ссылка) Тогда

			Продолжить;
			
		КонецЕсли;
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЦикла;

КонецПроцедуры

#EndRegion
