#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_НайтиПоСекретномуТокенуПроверкаПараметров(Фреймворк) Экспорт

	Фреймворк.Что(Справочники.ОбработчикиСобытий.НайтиПоСекретномуТокену(1)).ЭтоНеопределено();
	Фреймворк.Что(Справочники.ОбработчикиСобытий.НайтиПоСекретномуТокену("")).ЭтоНеопределено();
	Фреймворк.Что(Справочники.ОбработчикиСобытий.НайтиПоСекретномуТокену(Неопределено)).ЭтоНеопределено();
	Фреймворк.Что(Справочники.ОбработчикиСобытий.НайтиПоСекретномуТокену("блаблаблаблака")).ЭтоНеопределено();
	
КонецПроцедуры

// @unit-test
Процедура Тест_НайтиПоСекретномуТокенуПроверкаРезультата(Фреймворк) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		СекретныйТокен = "ЮнитТест";
		
		НовыйЭлемент = Тест_ОбщийМодульСервер.ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйТокен);
		Код1 = НовыйЭлемент.Ссылка.Код;
		
		НовыйЭлемент = Тест_ОбщийМодульСервер.ДобавитьОбработчикСобытий("ЮнитТест2", СекретныйТокен);
		Код2 = НовыйЭлемент.Ссылка.Код;
		
		Фреймворк.Что(Код2).Больше(Код1);
		Фреймворк.Что(Справочники.ОбработчикиСобытий.НайтиПоСекретномуТокену(СекретныйТокен).Код).Равно(Код2);
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти