#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("НастройкиСервисаОбработкиЗапросаГитлаб")
	;
	
КонецПроцедуры

Процедура НастройкиСервисаОбработкиЗапросаГитлаб() Экспорт
	
	// given
	Ожидание = Заглушка();
	
	// when
	Результат = НастройкиСервисовКлиентСервер.НастройкиСервисаОбработкиЗапросаГитлаб();
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.ИмеетДлину(Ожидание.Количество())
		.ИмеетСвойстваРавные(Ожидание);
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Заглушка()
	
	Результат = Новый Структура();
	Результат.Вставить("ОбрабатыватьГитлабЗапрос", Ложь);
	Результат.Вставить("ИмяФайлаСхемыМаршрута", "");
	Результат.Вставить("ТокенГитлаб", "");
	Результат.Вставить("ТаймаутГитлаб", 0);
	Результат.Вставить("ПользовательВнешнегоСервиса", "");
	Результат.Вставить("ПарольВнешнегоСервиса", "");
	Результат.Вставить("ТаймаутВнешнегоСервиса", 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
