// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// НайтиПоАдресуПубликации возвращает результат поиска получателей по адресу публикации информационной базы.
// Поиск осуществляется среди элементов непомеченных на удаление.
// 
// Параметры:
// 	Адрес - Строка - адрес публикации информационной базы получателя (URL);
// 	
// Возвращаемое значение:
// 	Массив из СправочникСсылка.Получатели - результат поиска:
//
Функция НайтиПоАдресуПубликации( Знач Адрес ) Экспорт
	
	Если ( ТипЗнч(Адрес) <> Тип("Строка") ) Then
		
		Возврат Новый Массив();
		
	КонецЕсли;
	
	Запрос = Новый Запрос( ТекстЗапросаПолученияЭлементаСправочникаПоАдресуПубликации() );
	
	Запрос.УстановитьПараметр( "Адрес", Адрес );
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "Получатель" );
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияЭлементаСправочникаПоАдресуПубликации()
	
	Возврат "ВЫБРАТЬ
	|	Получатели.Ссылка КАК Получатель
	|ИЗ
	|	Справочник.Получатели КАК Получатели
	|ГДЕ
	|	НЕ Получатели.ПометкаУдаления
	|	И Получатели.BaseURL = &Адрес";
	
КонецФункции

#КонецОбласти

#КонецЕсли