#Область ПрограммныйИнтерфейс

Процедура ЗапуститьОбработкуДанных( Знач ОбработчикСобытия, Знач ДанныеЗапроса, Знач ПовторныйЗапуск = Ложь) Экспорт
											
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьДанные() Экспорт
	
//	// получить
//	ОтправляемыеДанные = ПолучитьОтправляемыеДанные();
//	ОтправляемыеДанные = Маршрутизация.РаспределитьОтправляемыеДанныеПоМаршрутам( ОтправляемыеДанные, ДанныеЗапроса );
//	
//	// организовать отправку в фоне
//	ОтправитьДанныеПоМаршрутам( ОтправляемыеДанные );
	
КонецПроцедуры

#КонецОбласти