// @strict-types

#Область ПрограммныйИнтерфейс

// ОтобратьПоПрефиксуКлюча получает массив объектов ФоновоеЗадание по заданному отбору в привилегированном режиме
// с дополнительным отбором по префиксу ключа фонового задания.
// 
// Параметры:
// 	Отбор - Структура - параметр Отбор глобального метода ФоновыеЗадания.ПолучитьФоновыеЗадания;
// 	Префикс - Строка - дополнительный отбор по префиксу Ключа фонового задания;
// 	
// Возвращаемое значение:
// 	Массив из ФоновоеЗадание - отобранные фоновые задания;
//
Функция ОтобратьПоПрефиксуКлюча( Знач Отбор, Знач Префикс ) Экспорт
	
	Результат = Новый Массив(); // Массив из ФоновоеЗадание
	
	Если ( ТипЗнч(Отбор) <> Тип("Структура") ) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим( Истина );
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания( Отбор );
	
	Для Каждого Задание Из Задания Цикл
		
		Если ( НЕ СтрНачинаетсяС(Задание.Key, Префикс) ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Результат.Добавить( Задание );
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
