// @strict-types

#Область ОбработчикиСобытий

Функция StatusGet( Запрос )
	
	Возврат НастройкиСервисов.ПолучитьСтатусКакОтветСервиса( Метаданные.HTTPСервисы.GitLab );
	
КонецФункции

Функция EventsPost( Запрос )
	
	Попытка
		
		Возврат Гитлаб.ОбработатьЗапросСобытия( Запрос );
		
	Исключение
		
		// В журнале регистрации зафиксируем полное представление ошибки, а в вызывающий сервис отдадим только
		// конкретную ошибку, не раскрывая трассировки стека.
		ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору("INTERNAL_SERVER_ERROR");
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, ИнформацияОбОшибке );
		
		Логи.Ошибка( Логи.События().ВебСервис, ИнформацияОбОшибке,
			Логи.КонтекстОтветаСервиса(Ответ, Метаданные.HTTPСервисы.GitLab) );
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
