// @strict-types

#Область ПрограммныйИнтерфейс

// ПолучитьПараметрыСоединения возвращает параметры соединения с сервером GitLab.
// 
// Параметры:
// 	АдресСервера - Строка - URL сервера GitLab, например: "http://www.example.org";
//
// Возвращаемое значение:
//	ФиксированнаяСтруктура - описание:
// * URL - Строка - URL сервера GitLab;
// * Токен - Строка - см. Константа.ТокенГитлаб
// * Timeout - Число - см. Константа.ТаймаутГитлаб
//
Функция ПолучитьПараметрыСоединения( Знач АдресСервера ) Экспорт
	
	Результат = ВнешниеЗапросы.ПараметрыСоединения();
	Результат.URL = АдресСервера;
	Результат.Токен = НастройкиСервисов.ПолучитьТокенГитлаб();
	Результат.Timeout = НастройкиСервисов.ПолучитьТаймаутГитлаб();
	
	Возврат ( Новый ФиксированнаяСтруктура(Результат) );
	
КонецФункции

// TODO заменить на КИсходномуФайлу

// ПолучитьПутьКНеобработанномуФайлу возвращает относительный путь к необработанному (RAW) файлу в соответствии с
// GitLab REST API (v4), см. https://docs.gitlab.com/ee/api/repository_files.html#get-raw-file-from-repository.
// 
// Параметры:
// 	ПутьКФайлу - Строка - относительный путь к файлу на сервере GitLab, например, "а/б/в.epf";
// 	Проект - Строка - идентификатор проекта (json: project_id);
// 	Коммит - Строка - идентификатор коммита (json: commits[].id);
// 
// Возвращаемое значение:
// 	Строка - относительный путь к файлу в URL-кодировке,
// 			например "/api/v4/projects/1/repository/files/%D0%B0/%D0%B0%2F%D0%B1%2F%D0%B2.epf/raw?ref=123af";
//
Функция ПолучитьПутьКНеобработанномуФайлу( Знач ПутьКФайлу, Знач Проект, Знач Коммит ) Экспорт
	
	Шаблон = "/api/v4/projects/%1/repository/files/%2/raw?ref=%3";

	Возврат СтрШаблон( Шаблон, Проект, КодироватьСтроку(ПутьКФайлу, СпособКодированияСтроки.КодировкаURL), Коммит );
	
КонецФункции

// TODO ПолучитьИсходныеФайлы

// ПолучитьНеобработанныеФайлы возвращает скачанные с GitLab сервера необработанные (RAW) Результат с их описанием.
//
// Параметры:
// 	ПараметрыСоединения - см. ПолучитьПараметрыСоединения
// 	ПутиКФайлам - Массив из Строка - относительные пути к загружаемым RAW-файлам в URL-кодировке, например
// 								"/api/v4/projects/1/repository/files/%D0%B0/D0%BA%D0%B0%201.epf/raw?ref=ef3529e5486ff";
// 	
// Возвращаемое значение:
// 	Массив из см. ОписаниеФайла
// 
Функция ПолучитьНеобработанныеФайлы( Знач ПараметрыСоединения, Знач ПутиКФайлам ) Экспорт
	
	Результат = Новый Массив(); // Массив из см. ОписаниеФайла
	
	Для Каждого ПутьКНеобработанномуФайлу Из ПутиКФайлам Цикл
		
		Результат.Добавить( ЗагрузитьФайл(ПараметрыСоединения, ПутьКНеобработанномуФайлу) );
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// ПолучитьДанныеЗаполнения выполняет преобразование тела запроса в формате JSON в объектную модель с заполнением
// данных заполнения, опубликованных в интерфейсе внешних запросов, см. ВнешниеЗапросы.ДанныеЗаполнения().
// 
// Параметры:
//  Источник - Строка - тело внешнего запроса в формате JSON;
// 
// Возвращаемое значение:
// 	см. ВнешниеЗапросы.ДанныеЗаполнения
//
Функция ПолучитьДанныеЗаполнения( Знач Источник ) Экспорт
	
	ДанныеВнешнегоЗапроса = ОбщегоНазначенияВызовСервера.JsonВОбъект( Источник );
	
	Результат = ВнешниеЗапросы.ДанныеЗаполнения();
	
	Результат.Type = Перечисления.ИсточникЗапроса.Гитлаб;
	
	Результат.Идентификатор = ПолучитьИдентификаторСобытия( ДанныеВнешнегоЗапроса );
	
	ЗаполнитьПроект( Результат, ДанныеВнешнегоЗапроса );
	
	Для Каждого Коммит Из ПолучитьКоммиты( ДанныеВнешнегоЗапроса ) Цикл
		
		Результат.Коммиты.Добавить( ПолучитьОписаниеКоммита(Коммит) );
		
	КонецЦикла;
	
	Для Каждого ОписаниеФайла Из ПолучитьИнформациюОбИзмененныхФайлах( ДанныеВнешнегоЗапроса ) Цикл

		Результат.ModifiedFiles.Добавить(
			ПолучитьОписаниеИзмененногоФайла(ОписаниеФайла.Идентификатор, ОписаниеФайла.ПутьКФайлу) );

	КонецЦикла;
	
	Результат.Дата = ПолучитьДатуСобытия( Результат );
	
	Результат.Сообщение = ПолучитьСообщениеСобытия( ДанныеВнешнегоЗапроса, Результат );
	
	Возврат Результат;
	
КонецФункции

// ОбработатьЗапросСобытия выполняет обработку HTTP-запроса, отправленного сервером GitLab при срабатывании веб-хука:
// см. https://docs.gitlab.com/ee/user/project/integrations/webhook_events.html
// 
// Параметры:
// 	Запрос - HTTPСервисЗапрос - HTTP-запрос;
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ HTTP-сервиса;
//
Функция ОбработатьЗапросСобытия( Знач Запрос ) Экспорт

	Логи.Информация( Логи.События().ВебСервис, Логи.Сообщения().ПолученЗапросГитлаб );
	
	Ответ = Новый HTTPСервисОтвет( СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору("OK") );
	
	ПроверитьВключениеОбработкиЗапроса( Ответ );
	
	ПроверитьЗаголовки( Запрос, Ответ );
	
	Если ( НЕ СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		Возврат Ответ;
		
	КонецЕсли;
	
	ВнешнийЗапрос = СоздатьВнешнийЗапрос( Запрос );
	
	Аутентификация = УчетныеДанные.ПолучитьРеквизитыАутентификации( ВнешнийЗапрос.ПолучитьАдресПроекта() );
	
	ПроверитьНаличиеОбработчика( Аутентификация, Ответ );
	
	Аутентифицировать( Аутентификация, Запрос, Ответ );
	
	Если ( СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		ОбработкаДанных.ОбработатьЗапрос( Аутентификация.Обработчик, ВнешнийЗапрос );
		
		Логи.Информация( Логи.События().ВебСервис, Логи.Сообщения().ЗапросГитлабОбработан, Логи.Параметры( , , Ответ) );
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПроекта( Знач Идентификатор, Знач АдресПроекта)
	
	АдресСервера = ПолучитьАдресСервера( АдресПроекта );
	
	Возврат ( Новый Структура("Id, URL, ServerURL", Идентификатор, АдресПроекта, АдресСервера) );
	
КонецФункции

Функция ПолучитьАдресСервера( Знач Адрес )

	НОМЕР_ВХОЖДЕНИЯ = 3;
	
	Разделитель = СтрНайти( Адрес, "/", , , НОМЕР_ВХОЖДЕНИЯ ) - 1;
	
	Если ( Разделитель > 0 ) Тогда
		
		Возврат Лев( Адрес, Разделитель );
		
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

// ПолучитьОписаниеПроекта возвращает описание проекта из тела внешнего запроса, пришедшего с сервера GitLab.
// 
// Параметры:
//  ДанныеВнешнегоЗапроса - Соответствие из КлючИЗначение - десериализованное тело запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON;
// 	* Значение - Произвольный - значение для ключа;
// 	
// Возвращаемое значение:
// 	- Неопределено - данные отсутствуют;
// 	- Структура - описание проекта:
// * Id - Число - идентификатор проекта (json: project.id);
// * URL - Строка - веб-адрес (URL) GitLab проекта, например, "http://www.example.org/user/project";
// * ServerURL - Строка - веб-адрес (URL) сервера GitLab , например, "http://www.example.org";
// 
Функция ПолучитьОписаниеПроекта( Знач ДанныеВнешнегоЗапроса )
	
	Проект = ДанныеВнешнегоЗапроса.Получить( "project" ); // Соответствие
	
	Если ( ТипЗнч(Проект) <> Тип( "Соответствие") ) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	Идентификатор = Проект.Получить( "id" );
	
	АдресПроекта = Проект.Получить( "web_url" );

	Если ( ТипЗнч(Идентификатор) = Тип("Число") И ТипЗнч(АдресПроекта) = Тип("Строка") ) Тогда
		
		Возврат ОписаниеПроекта( Идентификатор, АдресПроекта );
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьПроект( Объект, Знач ДанныеВнешнегоЗапроса )
	
	Проект = ПолучитьОписаниеПроекта( ДанныеВнешнегоЗапроса );
	
	Если ( Проект = Неопределено ) Тогда
		
		Возврат;
	
	КонецЕсли;
	
	Объект.ProjectId = Строка( Проект.Id );
	
	Объект.АдресПроекта = Проект.URL;
	
	Объект.ServerURL = Проект.ServerURL;
	
КонецПроцедуры

// ПолучитьИдентификаторСобытия возвращает идентификатор "checkout_sha" из тела внешнего запроса,
// пришедшего с сервера GitLab.
// 
// Параметры:
//  ДанныеВнешнегоЗапроса - Соответствие из КлючИЗначение - десериализованное тело запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON;
// 	* Значение - Произвольный - значение для ключа;
// 	
// Возвращаемое значение:
// 	- Неопределено - данные отсутствуют;
// 	- Строка - идентификатор события (json: checkout_sha);
// 	
Функция ПолучитьИдентификаторСобытия( Знач ДанныеВнешнегоЗапроса )
	
	Возврат ДанныеВнешнегоЗапроса.Получить( "checkout_sha" );
	
КонецФункции

Функция ПолучитьДатуСобытия( Знач ДанныеЗаполнения )
	
	Для Каждого Коммит Из ДанныеЗаполнения.Коммиты Цикл
		
		Если ( Коммит.Идентификатор = ДанныеЗаполнения.Идентификатор ) Тогда
			
			Возврат Коммит.Дата;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Дата( 1, 1, 1 );
		
КонецФункции

// ПолучитьСообщениеСобытия возвращает сообщение с описанием события по данным тела внешнего запроса,
// пришедшего с сервера GitLab. Сообщение формируется на основе поля "message" схемы запроса.
// Если поле "message" не заполнено (null), то используется заголовок ("title") соответствующего коммита,
// определяемого по совпадению идентификатора "checkout_sha" с "commits[].id".
// 
// Параметры:
//  ДанныеВнешнегоЗапроса - Соответствие из КлючИЗначение - десериализованное тело запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON.
// 	* Значение - Произвольный - значение для ключа.
// 	ДанныеЗаполнения - см. ВнешниеЗапросы.ДанныеЗаполнения
// 
// Возвращаемое значение:
//  Строка - сообщение описывающее событие.
//
Функция ПолучитьСообщениеСобытия( Знач ДанныеВнешнегоЗапроса, Знач ДанныеЗаполнения )
	
	Результат = Строка( ДанныеВнешнегоЗапроса.Получить("message") );
	
	Если ( НЕ ПустаяСтрока(Результат) ) Тогда
		
		Возврат Результат;
	
	КонецЕсли;
		
	Для Каждого Коммит Из ДанныеЗаполнения.Коммиты Цикл
		
		Если ( Коммит.Идентификатор = ДанныеЗаполнения.Идентификатор ) Тогда
			
			Возврат Строка( Коммит.Заголовок );
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
		
КонецФункции

Функция ПолучитьОписаниеКоммита( Знач Коммит )

	Результат = Новый Структура();
	Результат.Вставить( "Идентификатор", Коммит.Получить("id") );
	Результат.Вставить( "Дата", Коммит.Получить("timestamp") );
	Результат.Вставить( "Заголовок", Коммит.Получить("title") );
	
	Возврат Результат;
	
КонецФункции

// ПолучитьКоммиты возвращает коллекцию коммитов из тела внешнего запроса, пришедшего с сервера GitLab.
// 
// Параметры:
//  ДанныеВнешнегоЗапроса - Соответствие из КлючИЗначение - десериализованное тело запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON;
// 	* Значение - Произвольный - значение для ключа;
//
// Возвращаемое значение:
// 	Массив из Соответствие - коммиты из десериализованного тела запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON;
// 	* Значение - Произвольный - значение для ключа;
// 
//@skip-check doc-comment-collection-item-type - внешний объект, конструктора нет, чтобы сослаться на него
Функция ПолучитьКоммиты( Знач ДанныеВнешнегоЗапроса )
	
	Результат = ДанныеВнешнегоЗапроса.Получить( "commits" );
	
	Если ( ТипЗнч(Результат) <> Тип( "Массив") ) Тогда
	
		Возврат Новый Массив();
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

Функция ИмеетРасширение( Знач ПутьКФайлу, Знач Расширение )
	
	Возврат СтрЗаканчиваетсяНа( ВРег(ПутьКФайлу), "." + ВРег(Расширение) );
	
КонецФункции

Функция ПолучитьОписаниеИзмененногоФайла( Знач Идентификатор, Знач ПутьКФайлу )
	
	Результат = Новый Структура();
	Результат.Вставить( "Идентификатор", Идентификатор );
	Результат.Вставить( "ПутьКФайлу", ПутьКФайлу );
	
	Возврат Результат;
	
КонецФункции

// ПолучитьИнформациюОбИзмененныхФайлах возвращает информацию об измененных файлах из тела
// внешнего запроса, пришедшего с сервера GitLab.
// 
// Параметры:
//  ДанныеВнешнегоЗапроса - Соответствие из КлючИЗначение - десериализованное тело запроса, пришедшего с сервера GitLab:
// 	* Ключ - Строка - ключ элемента JSON;
// 	* Значение - Произвольный - значение для ключа;
// 	
// Возвращаемое значение:
// 	Массив из Структура - данные об измененных файлах:
// 	* Идентификатор - Строка - идентификатор коммита (json: commits[].id);
// 	* ПутьКФайлу - Строка - относительный путь к файлу на сервере GitLab (json: commits[].modified[]),
// 							например, "а/б/в.epf"
//
Функция ПолучитьИнформациюОбИзмененныхФайлах( Знач ДанныеВнешнегоЗапроса )

	Результат = Новый Массив(); // Массив из Структура
	
	Для Каждого Коммит Из ПолучитьКоммиты( ДанныеВнешнегоЗапроса ) Цикл
		
		Идентификатор = Строка( Коммит.Получить("id") );
		
		ИзмененныеФайлы = Коммит.Получить( "modified" ); // Массив из Строка
		
		Если ( ИзмененныеФайлы = Неопределено ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для Каждого ПутьКФайлу Из ИзмененныеФайлы Цикл
			
			ПутьКФайлу = Строка( ПутьКФайлу ); // Типизация
			
			Если НЕ ( ИмеетРасширение(ПутьКФайлу, "EPF") ИЛИ ИмеетРасширение(ПутьКФайлу, "ERF") ) Тогда
				
				Продолжить;
			
			КонецЕсли;
			
			Результат.Добавить( ПолучитьОписаниеИзмененногоФайла(Идентификатор, ПутьКФайлу) );
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// ОписаниеФайла возвращает описание загруженного файла.
// 
// Возвращаемое значение:
//  Структура - Описание файла:
// * RAWFilePath - Строка - относительный путь к исходному (RAW) файлу;
// * ИмяФайла - Строка - имя файла (UTF-8);
// * BinaryData - Неопределено, ДвоичныеДанные - данные (файл);
// * ИнформацияОбОшибке - Неопределено, ИнформацияОбОшибке - информация об ошибке, если она была при загрузке файла; 
//
Функция ОписаниеФайла()
	
	Результат = Новый Структура();
	Результат.Insert( "RAWFilePath", "" );
	Результат.Insert( "ИмяФайла", "" );
	Результат.Insert( "BinaryData", Неопределено );
	Результат.Insert( "ИнформацияОбОшибке", Неопределено );
	
	Возврат Результат;

КонецФункции

// ДополнительныеПараметры возвращает дополнительные параметры вызова метода см. КоннекторHTTP.Get.
// 
// Параметры:
//  ПараметрыСоединения - см. ПолучитьПараметрыСоединения
// 
// Возвращаемое значение:
//  Структура - описание:
// * ПроверятьSSL - Булево - Ложь - проверка сертификата сервера не выполняется
//							Истина - используется значение СертификатыУдостоверяющихЦентровОС;
// * Заголовки - Соответствие из КлючИЗначение - HTTP заголовки запроса:
// ** Ключ - Строка
// ** Значение - Произвольный
// * Таймаут - Число - время ожидания осуществляемого соединения и операций, в секундах;
//
Функция ДополнительныеПараметры( Знач ПараметрыСоединения )
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить( "PRIVATE-TOKEN", ПараметрыСоединения.Токен);
	
	Результат = Новый Структура();
	Результат.Вставить( "ПроверятьSSL", Ложь );
	Результат.Вставить( "Заголовки", Заголовки );
	Результат.Вставить( "Таймаут", ПараметрыСоединения.Timeout );
	
	Возврат Результат;
	
КонецФункции

// ЗагрузитьФайл возвращает скачанный с GitLab сервера необработанный (RAW) файл с его описанием.
// 
// Параметры:
// 	ПараметрыСоединения - см. ПолучитьПараметрыСоединения
// 	ПутьКФайлу - Строка - относительный путь к файлу в URL-кодировке,
// 			например "/api/v4/projects/1/repository/files/%D0%B0/%D0%B0%2F%D0%B1%2F%D0%B2.epf/raw?ref=123af"
// 	
// Возвращаемое значение:
// 	см. ОписаниеФайла
//
Функция ЗагрузитьФайл( Знач ПараметрыСоединения, Знач ПутьКФайлу )
	
	Результат = ОписаниеФайла();
	
	Результат.RAWFilePath = ПутьКФайлу;

	АдресСервера = ПараметрыСоединения.URL + ПутьКФайлу; // Строка

	Попытка
		
		Если ( ПустаяСтрока(ПутьКФайлу) ) Тогда
			
			ВызватьИсключение Логи.Сообщения().NO_RAWPATH;
			
		КонецЕсли;
		
		Ответ = КоннекторHTTP.Get( АдресСервера, Неопределено, ДополнительныеПараметры(ПараметрыСоединения) );
		
		Если ( НЕ СервисыHTTP.КодыСостояния().IsOk(Ответ.КодСостояния) ) Тогда
			
			ВызватьИсключение СервисыHTTP.КодыСостояния().НайтиИдентификаторПоКоду( Ответ.КодСостояния );
		
		КонецЕсли;
		
		Результат.ИмяФайла = ПолучитьИмяФайла( Ответ );
		
		Результат.BinaryData = КоннекторHTTP.КакДвоичныеДанные( Ответ );
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
		
		Результат.ИнформацияОбОшибке = ФайлыВнешнегоХранилища.ПолучитьОшибкуЗагрузкиФайла(
				ПредставлениеОшибки, АдресСервера );
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// ПолучитьИмяФайла возвращает имя файла из заголовков ответа веб-сервиса.
// 
// Параметры:
//  Ответ - см. КоннекторHTTP.ВызватьМетод
// 
// Возвращаемое значение:
//  Строка - имя файла;
//
Функция ПолучитьИмяФайла( Знач Ответ )
	
	Возврат Ответ.Заголовки.Получить( "X-Gitlab-File-Name" );
	
КонецФункции

#Область Сервисы

Функция ШаблонИмениМетодаИСобытиеСовпадают( Знач Запрос, Знач Событие )
	
	ИмяМетода = Запрос.ПараметрыURL.Get( "ИмяМетода" ); // Неопределено, Строка
	
	Возврат ( ИмяМетода <> Неопределено И СтрНайти(НРег(Событие), НРег(ИмяМетода)) <> 0 );
	
КонецФункции

Функция СоздатьВнешнийЗапрос( Знач Запрос )
	
	ВнешнийЗапрос = ВнешниеЗапросы.Создать( Запрос.ПолучитьТелоКакСтроку() );
	
	Если НЕ ВнешнийЗапрос.ПроверитьЗаполнение() Тогда
		
		ВызватьИсключение Логи.Сообщения().BAD_JSON_DATA;
		
	КонецЕсли;
	
	Возврат ВнешнийЗапрос;
	
КонецФункции

#Область Проверки

Процедура ПроверитьВключениеОбработкиЗапроса( Ответ )
	
	Если ( НЕ СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ( НЕ НастройкиСервисов.ОбработкаЗапросаВключена(Метаданные.HTTPСервисы.GitLab) ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "LOCKED" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().GITLAB_DISABLED );
		
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().GITLAB_DISABLED, Логи.Параметры( , , Ответ) );
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаголовки( Знач Запрос, Ответ )
	
	Если ( НЕ СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Токен = СервисыHTTP.НайтиЗаголовок( Запрос, "X-Gitlab-Token" );
	
	Если ( НЕ ЗначениеЗаполнено(Токен) ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "BAD_REQUEST" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().NO_TOKEN );
		
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().NO_TOKEN, Логи.Параметры( , , Ответ) );
		
		Возврат;
		
	КонецЕсли;
	
	Событие = СервисыHTTP.НайтиЗаголовок( Запрос, "X-Gitlab-Event" ); // Неопределено, Строка
	
	Если ( НЕ ЗначениеЗаполнено(Событие) ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "BAD_REQUEST" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().NO_EVENT );
		
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().NO_EVENT, Логи.Параметры( , , Ответ) );
		
		Возврат;
		
	КонецЕсли;
	
	Если ( НЕ ШаблонИмениМетодаИСобытиеСовпадают(Запрос, Событие) ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "BAD_REQUEST" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().НеверноеСобытие );
		
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().НеверноеСобытие, Логи.Параметры( , , Ответ) );
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеОбработчика( Знач Аутентификация, Ответ )
	
	Если ( НЕ СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ( НЕ ЗначениеЗаполнено(Аутентификация) ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "NOT_FOUND" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().REQUEST_HANDLER_NOT_FOUND );
		
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().REQUEST_HANDLER_NOT_FOUND,
			Логи.Параметры( , , Ответ) );
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Аутентифицировать( Знач Аутентификация, Знач Запрос, Ответ )
	
	Если ( НЕ СервисыHTTP.КодыСостояния().isOk(Ответ.КодСостояния) ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Токен = СервисыHTTP.НайтиЗаголовок( Запрос, "X-Gitlab-Token" );
	
	Если ( Аутентификация.Токен <> Токен ) Тогда
		
		КодСостояния = СервисыHTTP.КодыСостояния().НайтиКодПоИдентификатору( "UNAUTHORIZED" );
		
		Ответ = СервисыHTTP.СоздатьОтвет( КодСостояния, Логи.Сообщения().ТокенНеНайден );
			
		Логи.Ошибка( Логи.События().ВебСервис, Логи.Сообщения().ТокенНеНайден,
			Логи.Параметры( , , Ответ));
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
