#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ПолучитьВерсиюКакОтветСервиса")
	;
	
КонецПроцедуры

Процедура ПолучитьВерсиюКакОтветСервиса() Экспорт
	
	// given
	СервисЗапрос = ОМ_Тесты.ЮТест().Данные().HTTPСервисЗапрос();
	
	// when
	Результат = Конфигурация.ПолучитьВерсиюКакОтветСервиса(СервисЗапрос);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип(Тип("HTTPСервисОтвет"));
		
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат.КодСостояния)
		.Равно(200);
		
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат.Заголовки.Получить("Content-Type"))
		.Равно("application/json");
		
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат.ПолучитьТелоКакСтроку())
		.Содержит("version")
		.Содержит(Метаданные.Версия);
		
КонецПроцедуры

#КонецОбласти
