// BSLLS-выкл.
#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_НайтиПоСекретномуКлючу(Фреймворк) Экспорт
	
	Фреймворк.ПроверитьНеЗаполненность(ОбработчикиСобытий.НайтиПоСекретномуКлючу(1));
	Фреймворк.ПроверитьНеЗаполненность(ОбработчикиСобытий.НайтиПоСекретномуКлючу(""));
	Фреймворк.ПроверитьНеЗаполненность(ОбработчикиСобытий.НайтиПоСекретномуКлючу(Неопределено));
	Фреймворк.ПроверитьНеЗаполненность(ОбработчикиСобытий.НайтиПоСекретномуКлючу("блаблаблаблака"));

	НачатьТранзакцию();
	
	Попытка
		
		СекретныйКлюч = "ЮнитТест";
		
		НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
		Код1 = НовыйЭлемент.Ссылка.Код;
		
		НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест2", СекретныйКлюч);
		Код2 = НовыйЭлемент.Ссылка.Код;
		
		Фреймворк.Что(Код2).Больше(Код1);
		Фреймворк.Что(ОбработчикиСобытий.НайтиПоСекретномуКлючу(СекретныйКлюч).Код).Равно(Код2);
		
		НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест3", СекретныйКлюч + "Бадабумс");
		Фреймворк.Что(ОбработчикиСобытий.НайтиПоСекретномуКлючу(СекретныйКлюч).Код).Равно(Код2);
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьОбработчикСобытий(Знач Наименование = "", Знач СекретныйКлюч = "") Экспорт
	
		НовыйЭлемент = Справочники.ОбработчикиСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.СекретныйКлюч = СекретныйКлюч;
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент;
	
КонецФункции

#КонецОбласти