#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура НайтиПоСекретномуКлючуПустаяСсылкаЕслиПараметрЧисло(Фреймворк) Экспорт

	// given
	УдалитьВсеОбработчикиСобытий();
	// when
	Результат = ОбработчикиСобытий.НайтиПоСекретномуКлючу(1);
	// then
	Фреймворк.ПроверитьНеЗаполненность(Результат);

КонецПроцедуры

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура НайтиПоСекретномуКлючуПустаяСсылкаЕслиПараметрПустаяСтрока(Фреймворк) Экспорт

	// given
	УдалитьВсеОбработчикиСобытий();
	// when
	Результат = ОбработчикиСобытий.НайтиПоСекретномуКлючу("");
	// then
	Фреймворк.ПроверитьНеЗаполненность(Результат);

КонецПроцедуры

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура НайтиПоСекретномуКлючуПустаяСсылкаЕслиПараметрНеопределено(Фреймворк) Экспорт

	// given
	УдалитьВсеОбработчикиСобытий();
	// when
	Результат = ОбработчикиСобытий.НайтиПоСекретномуКлючу(Неопределено);
	// then
	Фреймворк.ПроверитьНеЗаполненность(Результат);

КонецПроцедуры

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура НайтиПоСекретномуКлючуПустаяСсылкаЕслиНеНайдено(Фреймворк) Экспорт

	// given
	УдалитьВсеОбработчикиСобытий();
	// when
	Результат = ОбработчикиСобытий.НайтиПоСекретномуКлючу("блаблаблаблака");
	// then
	Фреймворк.ПроверитьНеЗаполненность(Результат);

КонецПроцедуры

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура НайтиПоСекретномуКлючу(Фреймворк) Экспорт
	
	// given
	СекретныйКлюч = "ЮнитТест";
	УдалитьВсеОбработчикиСобытий();
	НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйКлюч);
	НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест2", СекретныйКлюч);
	Код = НовыйЭлемент.Ссылка.Код;
	НовыйЭлемент = ДобавитьОбработчикСобытий("ЮнитТест3", СекретныйКлюч + "Бадабумс");
	// when	
	Результат = ОбработчикиСобытий.НайтиПоСекретномуКлючу(СекретныйКлюч);
	// then
	Фреймворк.Что(Результат.Код).Равно(Код);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьОбработчикСобытий(Знач Наименование = "", Знач СекретныйКлюч = "")
	
		НовыйЭлемент = Справочники.ОбработчикиСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.СекретныйКлюч = СекретныйКлюч;
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент;
	
КонецФункции

Процедура УдалитьВсеОбработчикиСобытий()
	
	ВсеЭлементы = Справочники.ОбработчикиСобытий.Выбрать();
	Пока ВсеЭлементы.Следующий() Цикл
		Объект = ВсеЭлементы.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;

КонецПроцедуры
	
#КонецОбласти