// @strict-types

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса( ТребуемыеПараметры )

	ПараметрыСеанса.ДлинаХэшаКоммита = ПолучитьКраткуюДлинуХэшаКоммита();
	ПараметрыСеанса.РазделительКлюча = " | ";
	ПараметрыСеанса.РазделительСообщений = ": ";

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКраткуюДлинуХэшаКоммита()
	
	Возврат Метаданные.ОпределяемыеТипы.КраткийИдентификаторКоммита.Тип.КвалификаторыСтроки.Длина;
	
КонецФункции	

#КонецОбласти
