
&Вместо("Восстановить")
Функция Мок_Восстановить(Знач RequestHandler, Знач CheckoutSHA) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(RequestHandler, CheckoutSHA);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(ВнешниеЗапросы, "Восстановить", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(RequestHandler, CheckoutSHA);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции

&Вместо("Сохранить")
Процедура Мок_Сохранить(Знач RequestHandler, Знач CheckoutSHA, Знач ExternalRequest) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(RequestHandler, CheckoutSHA, ExternalRequest);
	
	ПрерватьВыполнение = Ложь;
	ОМ_Тесты.Мокито().АнализВызова(ВнешниеЗапросы, "Сохранить", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(RequestHandler, CheckoutSHA, ExternalRequest);
	КонецЕсли;

КонецПроцедуры

&Вместо("Создать")
Функция Мок_Создать(Знач Источник) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Источник);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(ВнешниеЗапросы, "Создать", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Источник);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
