#Область ПрограммныйИнтерфейс

// Преобразует строку из одной кодировки в другую.
//
// Параметры:
// 	Строка - Строка - исходная строка;
// 	КодировкаИз - Строка - кодировка, из которой необходимо сделать конвертацию;
// 	КодировкаВ - Строка - кодировка, в которую необходимо сделать конвертацию;
//
// Возвращаемое значение:
// 	Строка - результирующая строка в новой кодировке;
//
Функция ПерекодироватьСтроку(Знач Строка, Знач КодировкаИз, Знач КодировкаВ = "UTF-8") Экспорт
	
	Перем Поток;
	Перем Запись;
	Перем Чтение;
	
	Поток = Новый ПотокВПамяти();
	Запись = Новый ЗаписьДанных(Поток, КодировкаИз);
	Запись.ЗаписатьСтроку(Строка);
	Поток.Перейти(0, ПозицияВПотоке.Начало);
	Чтение = Новый ЧтениеДанных(Поток, КодировкаВ);

	Возврат Чтение.ПрочитатьСтроку();
	
КонецФункции

#КонецОбласти