#Region Internal

// @unit-test
Procedure InfoOnlyEvent(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация1.Информация2.Информация3';en = 'Webhooks.Информация1.Информация2.Информация3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	// when
	Logging.Info( "Информация1.Информация2.Информация3", "обушки-воробушки");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");

EndProcedure

// @unit-test
Procedure WarnOnlyEvent(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение1.Предупреждение2.Предупреждение3';en = 'Webhooks.Предупреждение1.Предупреждение2.Предупреждение3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение"); 
	// when
	Logging.Warn( "Предупреждение1.Предупреждение2.Предупреждение3", "обушки-воробушки2");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorOnlyEvent(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка1.Ошибка2.Ошибка3';en = 'Webhooks.Ошибка1.Ошибка2.Ошибка3'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	// when
	Logging.Error( "Ошибка1.Ошибка2.Ошибка3", "обушки-воробушки3");
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	
EndProcedure

// @unit-test
Procedure InfoEventWithObject(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация11.Информация22.Информация33';en = 'Webhooks.Информация11.Информация22.Информация33'");
	
	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Info( "Информация11.Информация22.Информация33", "обушки-воробушки", Webhook.Ref );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Информация");
	
EndProcedure

// @unit-test
Procedure WarnEventWithObject(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение11.Предупреждение22.Предупреждение33';en = 'Webhooks.Предупреждение11.Предупреждение22.Предупреждение33'");

	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Warn( "Предупреждение11.Предупреждение22.Предупреждение33", "обушки-воробушки2", Webhook.Ref );
	// then	
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorEventWithObject(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка11.Ошибка22.Ошибка33';en = 'Webhooks.Ошибка11.Ошибка22.Ошибка33'");
	
	// given
	УдалитьВсеОбработчикиСобытий();
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	Webhook = TestsWebhooksServer.ДобавитьОбработчикСобытий("ТестЛогирование", "ТестЛогирование");
	// when
	Logging.Error( "Ошибка11.Ошибка22.Ошибка33", "обушки-воробушки3", Webhook.Ref );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].MetadataPresentation), "Ошибка");
	
EndProcedure

// @unit-test
Procedure InfoEventWithObjectAndHTTPResponse200(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация111.Информация222.Информация333.200';en = 'Webhooks.Информация111.Информация222.Информация333.200'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	Response = Новый HTTPСервисОтвет(200);
	// when
	Logging.Info( "Информация111.Информация222.Информация333", "обушки-воробушки", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьВхождение(Результат[0].Comment, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 200, "Информация");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""info""", "Информация");
	
EndProcedure

// @unit-test
Procedure WarnEventWithObjectAndHTTPResponse200(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение111.Предупреждение222.Предупреждение333.200';en = 'Webhooks.Предупреждение111.Предупреждение222.Предупреждение333.200'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	Response = Новый HTTPСервисОтвет(200);
	// when
	Logging.Warn( "Предупреждение111.Предупреждение222.Предупреждение333", "обушки-воробушки2", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 200, "Предупреждение");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""warning""", "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorEventWithObjectAndHTTPResponse200(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка111.Ошибка222.Ошибка333.200';en = 'Webhooks.Ошибка111.Ошибка222.Ошибка333.200'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	Response = Новый HTTPСервисОтвет(200);
	// when
	Logging.Error( "Ошибка111.Ошибка222.Ошибка333", "обушки-воробушки3", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 200, "Ошибка");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""error""", "Ошибка");

EndProcedure

// @unit-test
Procedure InfoEventWithObjectAndHTTPResponse400(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация1111.Информация2222.Информация3333.400';en = 'Webhooks.Информация1111.Информация2222.Информация3333.400'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE);
	Response = Новый HTTPСервисОтвет(400);
	// when
	Logging.Info( "Информация1111.Информация2222.Информация3333", "обушки-воробушки", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 400, "Информация");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(Response.GetBodyAsString()), "Информация");

EndProcedure

// @unit-test
Procedure WarnEventWithObjectAndHTTPResponse400(Фреймворк) Export

	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Предупреждение1111.Предупреждение2222.Предупреждение3333.400';en = 'Webhooks.Предупреждение1111.Предупреждение2222.Предупреждение3333.400'");
	
	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Предупреждение");
	Response = Новый HTTPСервисОтвет(400);
	// when
	Logging.Warn( "Предупреждение1111.Предупреждение2222.Предупреждение3333", "обушки-воробушки2", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 400, "Предупреждение");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(Response.GetBodyAsString()), "Предупреждение");
	
EndProcedure

// @unit-test
Procedure ErrorEventWithObjectAndHTTPResponse400(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Ошибка1111.Ошибка2222.Ошибка3333.400';en = 'Webhooks.Ошибка1111.Ошибка2222.Ошибка3333.400'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Ошибка");
	Response = Новый HTTPСервисОтвет(400);
	// when
	Logging.Error( "Ошибка1111.Ошибка2222.Ошибка3333", "обушки-воробушки3", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Comment, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 400, "Ошибка");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(Response.GetBodyAsString()), "Ошибка");
	
EndProcedure

// @unit-test
Procedure InfoEventWithObjectAndHTTPResponseWithBody200(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация200.Информация200.Информация200.200';en = 'Webhooks.Информация200.Информация200.Информация200.200'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Информация");
	Response = Новый HTTPСервисОтвет(200);
	// when
	Logging.Info( "Информация200.Информация200.Информация200", "обушки-воробушки", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация.200");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 200, "Информация.200");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""info""", "Информация.200");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """message"": ""обушки-воробушки""", "Информация.200");	
			
EndProcedure	

// @unit-test
Procedure InfoEventWithObjectAndHTTPResponseWithBody400(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация400.Информация400.Информация400.400';en = 'Webhooks.Информация400.Информация400.Информация400.400'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Информация");
	Response = Новый HTTPСервисОтвет(400);
	// when
	Logging.Info( "Информация400.Информация400.Информация400", "обушки-воробушки2", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация.400");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 400, "Информация.400");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(Response.GetBodyAsString()), "Информация.400");				

EndProcedure	

// @unit-test:dev
Procedure InfoEventWithObjectAndHTTPResponseWithBody403(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация403.Информация403.Информация403.403';en = 'Webhooks.Информация403.Информация403.Информация403.403'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Информация");
	Response = Новый HTTPСервисОтвет(403);
	// when
	Logging.Info( "Информация403.Информация403.Информация403", "обушки-воробушки3", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация.403");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 403, "Информация.403");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""info""", "Информация.403");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """message"": ""обушки-воробушки3""", "Информация.403");	

EndProcedure

// @unit-test:dev
Procedure InfoEventWithObjectAndHTTPResponseWithBody423(Фреймворк) Export
	
	EVENT_MESSAGE = НСтр("ru = 'ОбработчикиСобытий.Информация423.Информация423.Информация423.423';en = 'Webhooks.Информация423.Информация423.Информация423.423'");

	// given
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(EVENT_MESSAGE, "Информация");
	Response = Новый HTTPСервисОтвет(423);
	// when
	Logging.Info( "Информация423.Информация423.Информация423", "обушки-воробушки4", , Response );
	// then
	Результат = СобытияЖурналаРегистрации(ОтборЖурналаРегистрации);
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация.423");
	Фреймворк.ПроверитьРавенство(Response.StatusCode, 423, "Информация.423");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """type"": ""info""", "Информация.423");
	Фреймворк.ПроверитьВхождение(Response.GetBodyAsString(), """message"": ""обушки-воробушки4""", "Информация.423");	

EndProcedure

// @unit-test
Procedure ДополнитьСообщениеПрефиксом(Фреймворк) Export
	
	// given
	Префикс = "Префикс";
	Сообщение = "Текст сообщения.";
	// when
	Результат = Logging.AddPrefix(Сообщение, Префикс);
	// then
	Фреймворк.ПроверитьРавенство(Результат, "[ Префикс ]: Текст сообщения.");
	
EndProcedure	

#EndRegion

#Region Private
Procedure УдалитьВсеОбработчикиСобытий()
	
	TestsCommonUseServer.СправочникиУдалитьВсеДанные("Webhooks");

EndProcedure

Function ОтборЖурналаРегистрации(Событие, Уровень = "Информация")
	
	Возврат TestsCommonUseServer.ОтборЖурналаРегистрации(Событие, Уровень);
	
EndFunction

Function СобытияЖурналаРегистрации(Отбор, Секунд = 2)
	
	Возврат TestsCommonUseServer.СобытияЖурналаРегистрации(Отбор, Секунд);
	
EndFunction

#EndRegion
