// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьСервис( Команда )
	
	ПараметрыОткрытия = ПолучателиКлиентСервер.ПараметрыСоединения();
	ПараметрыОткрытия.Пользователь = НаборКонстант.ПользовательВнешнегоСервиса;
	ПараметрыОткрытия.Пароль = НаборКонстант.ПарольВнешнегоСервиса;
	ПараметрыОткрытия.Таймаут = НаборКонстант.ТаймаутВнешнегоСервиса;
	
	ОткрытьФорму( "ОбщаяФорма.ПроверкаВнешнегоСервиса",
		ПараметрыОткрытия, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );

КонецПроцедуры

#КонецОбласти
