#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:fast
Процедура Тест_СервисПолучателяДоступен(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPGet(URL + "/version");
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	Поток = Результат.Тело.ОткрытьПотокДляЧтения();
	ЧтениеТекста = Новый ЧтениеТекста( Поток, КодировкаТекста.UTF8 );
	ТелоОтвета = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Поток.Закрыть();
	
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """message""");

КонецПроцедуры

// @unit-test
Процедура Тест_ПередачаДвоичныхДанных(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	URL = URL + "/switch";
	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Value", "true");
	
	ДополнительныеПараметры  = Новый Структура;
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL, , ДополнительныеПараметры);
	

КонецПроцедуры

#КонецОбласти