#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:fast
Процедура Тест_СервисПолучателяДоступен(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPGet(URL + "/version");
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	ТелоОтвета = ТелоОтвета(Результат);
	
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """message""");

КонецПроцедуры

// @unit-test
Процедура Тест_ПередачаДвоичныхДанных(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	Token = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ApiKeyИБПолучателя");
	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Value", "true");
	Заголовки.Вставить("Token", Token);
	ДополнительныеПараметры  = Новый Структура;
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);

	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL + "/switch", , ДополнительныеПараметры);
	
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	ТелоОтвета = ТелоОтвета(Результат);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """Включено.""");

	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Token", Token);
	Name = Тест_ПолучателиСервер.КодироватьСтрокуURL("ВнешняяОбработка1.epf");

	Заголовки.Вставить("Name", Name);
	ДополнительныеПараметры  = Новый Структура;
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
	Данные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\receiver\Внешняя Обработка 2.epf");
	
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL + "/update", Данные, ДополнительныеПараметры);
	
	ТелоОтвета = ТелоОтвета(Результат);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """Файлы успешно заменены.""");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТелоОтвета(Знач Ответ)
	
	Перем ЧтениеТекста;
	Перем Поток;
	Перем Результат;
	
	Поток = Ответ.Тело.ОткрытьПотокДляЧтения();
	ЧтениеТекста = Новый ЧтениеТекста( Поток, КодировкаТекста.UTF8 );
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	Поток.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти