#Область СлужебныйПрограммныйИнтерфейс

//@unit-test
Процедура Тест_ПолучитьОписаниеСервисаСоответствуетЭталону(Фреймворк) Экспорт

	Тест_РаботаСИнтернетСервисамиСервер.УстановитьЗагружатьФайлыИзВнешнегоХранилища(Истина);
	
	ОписаниеСервиса = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервиса("gitlab");
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("enabled"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.Свойство("templates"));
	Фреймворк.ПроверитьРавенство(ОписаниеСервиса.templates.Количество(), 2);
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("template"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].Свойство("methods"));
	Фреймворк.ПроверитьРавенство(ОписаниеСервиса.templates[0].methods.Количество(), 1);
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("name"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("desc"));
	Фреймворк.ПроверитьИстину(ОписаниеСервиса.templates[0].methods[0].Свойство("method"));
	
	Тест_РаботаСИнтернетСервисамиСервер.УстановитьЗагружатьФайлыИзВнешнегоХранилища(Ложь);

КонецПроцедуры

// @unit-test
Процедура Тест_ПолучитьОписаниеСервисаURL(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисовИБРаспределителя");
	Фреймворк.ПроверитьЗаполненность(URL, "Нет URL (user_settings.json -> МестоположениеСервисовИБРаспределителя");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(URL), "URL не может быть пустым, проверьте user_settings.json.");
	
	BadURL = "йохохо";
	Шаблон = СтрШаблон("а = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервисаURL(""%1"")", BadURL);
	Фреймворк.ПроверитьНеВыполнилось(Шаблон, "Ошибка работы с Интернет:   Couldn't resolve host name");

	BadURL = "";
	Ответ = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервисаURL(BadURL);
	Фреймворк.ПроверитьТип(Ответ, "Неопределено");

	BadURL = Новый Массив;
	Ответ = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервисаURL(BadURL);
	Фреймворк.ПроверитьТип(Ответ, "Неопределено");
	
	BadURL = URL + "йохохо";
	Ответ = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервисаURL(BadURL);
	Фреймворк.ПроверитьТип(Ответ, "Неопределено", "При ошибочном имени сервиса должно вернуться Неопределено.");

	// 200
	Ответ = Тест_РаботаСИнтернетСервисамиСервер.ПолучитьОписаниеСервисаURL(URL + "/services");
	Фреймворк.ПроверитьИстину(Ответ.Свойство("Ответ"));
	Фреймворк.ПроверитьТип(Ответ.Ответ, "Структура", "Веб-сервис не отвечает.");
	Фреймворк.ПроверитьЗаполненность(Ответ.Ответ, "Ответ веб-сервиса не должен быть пустым.");
	Фреймворк.ПроверитьРавенство(Ответ.Ответ.КодСостояния, 200, "Веб-сервис отвечает, но с ошибкой.");

	Фреймворк.ПроверитьРавенство(Ответ.Количество(), 3);
	Фреймворк.ПроверитьИстину(Ответ.Свойство("Ответ"));
	Фреймворк.ПроверитьИстину(Ответ.Свойство("Соответствие"));
	Фреймворк.ПроверитьИстину(Ответ.Свойство("json"));
	Фреймворк.ПроверитьВхождение(Ответ.json, """version""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """services""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """enabled""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """templates""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """template""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """methods""");
	Фреймворк.ПроверитьВхождение(Ответ.json, """method""");	

КонецПроцедуры

#КонецОбласти