#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:fast
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура СервисПолучателяДоступен(Фреймворк) Экспорт
	
	//given
	Мок = Обработки.MockServerClient.Создать();
	Мок.Сервер("http://host.docker.internal:1080").Сбросить();
	Настройки = "
		|		""version"": ""200""";
	Мок.ИмпортироватьНастройки("file:/tmp/receiver.yaml", Настройки);
	Мок = Неопределено;
	
	URL = "http://host.docker.internal:1080";
	
	//when
	Результат = КоннекторHTTP.Get(URL + "/version");
	//then
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	//when
	ТелоОтвета = КоннекторHTTP.КакТекст(Результат, КодировкаТекста.UTF8);
	//then
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """message""");

КонецПроцедуры

// @unit-test:fast
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура ПередачаДвоичныхДанных(Фреймворк) Экспорт
	
	Мок = Обработки.MockServerClient.Создать();
	Мок.Сервер("http://host.docker.internal:1080");
	
	URL = "http://host.docker.internal:1080";	

	//given
	// Не заданы параметры доставки	
	ИмяФайла = "ВнешняяОбработка1.epf";
	Данные = ПолучитьДвоичныеДанныеИзСтроки("Тест");
	ПараметрыДоставки = Новый Структура;
	//when
	Попытка
		ПередачаДанных.ОтправитьФайл(ИмяФайла, Данные, ПараметрыДоставки);
		ВызватьИсключение НСтр("ru = 'Передача данных без параметров доставки должна вызывать ошибку.'");
	Исключение
		//then
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Фреймворк.ПроверитьВхождение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке),
		 							"ожидалось свойство АдресДоставки");
	КонецПопытки;

	// given	
	// 403
	Мок.Сбросить();
	Настройки = "
		|		""update"": ""403""";
	Мок.ИмпортироватьНастройки("file:/tmp/receiver.yaml", Настройки);
	
	ПараметрыДоставки.Вставить("АдресДоставки", URL + "/update");
	ПараметрыДоставки.Вставить("Token", "12345678901234567890");
	ПараметрыДоставки.Вставить("Таймаут", 5);
	// when	
	Попытка
		ПередачаДанных.ОтправитьФайл(ИмяФайла, Данные, ПараметрыДоставки);
	Исключение
		// then
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Фреймворк.ПроверитьРавенство(КраткоеПредставлениеОшибки(ИнформацияОбОшибке), "Error: 403");
	КонецПопытки;

	// given	
	// 200
	Мок.Сбросить();
	Настройки = "
		|		""update"": ""200""";
	Мок.ИмпортироватьНастройки("file:/tmp/receiver.yaml", Настройки);
	Мок = Неопределено;
	
	ПараметрыДоставки.Вставить("АдресДоставки", URL + "/update");
	ПараметрыДоставки.Вставить("Token", "12345678901234567890");
	ПараметрыДоставки.Вставить("Таймаут", 5);
	// when
	ПередачаДанных.ОтправитьФайл(ИмяФайла, Данные, ПараметрыДоставки);
	// then
	СообщенияПриПередачеДанных = ПолучитьСообщенияПользователю();	
	Фреймворк.ПроверитьВхождение(СообщенияПриПередачеДанных[0].Текст, "Любое сообщение...");
	
КонецПроцедуры

// @unit-test:fast
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
//
Процедура ПередачаДвоичныхДанныхВФоне(Фреймворк) Экспорт
	
	// given
	ИмяФайла = "ВнешняяОбработка1.epf";
	Данные = ПолучитьДвоичныеДанныеИзСтроки("Тест");
	ПараметрыДоставки = Новый Структура;

	// Имитируем ошибку в параметрах (нет параметров доставки)	
	// when
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяФайла);
	ПараметрыЗадания.Добавить(Данные);
	ПараметрыЗадания.Добавить(ПараметрыДоставки);
	ЗаданиеОтправкаФайла = ФоновыеЗадания.Выполнить("ПередачаДанных.ОтправитьФайл",
													ПараметрыЗадания);
	Результат = ЗаданиеОтправкаФайла.ОжидатьЗавершенияВыполнения();
	
	//then
	Фреймворк.ПроверитьРавенство(Результат.Состояние, СостояниеФоновогоЗадания.ЗавершеноАварийно);
	Фреймворк.ПроверитьРавенство(Результат.ПолучитьСообщенияПользователю().Количество(), 0);

//	// 404
//	// when
//	ПараметрыДоставки.Вставить("АдресДоставки", URL + "/fake");
//	ПараметрыДоставки.Вставить("Token", Token);
//	ПараметрыДоставки.Вставить("Таймаут", 5);	
//	// then	
//	Сообщение = Неопределено;
//	Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки, Сообщение);
//	Фреймворк.ПроверитьНеРавенство(СтрНайти(Сообщение[0].Текст, "Сообщение: 404"), 0);

//	// 200
//	// when
//	ПараметрыДоставки.Вставить("АдресДоставки", URL + "/update");
//	ПараметрыДоставки.Вставить("Token", "12345678901234567890");
//	ПараметрыДоставки.Вставить("Таймаут", 5);
//	// then	
//	Сообщение = Неопределено;
//	Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки, Сообщение);
//	Фреймворк.ПроверитьНеРавенство(СтрНайти(Сообщение[0].Текст, "Файлы успешно заменены."), 0);
	
//	Данные = ПолучитьИзВременногоХранилища(Адрес);
//
//	МассивФоновыхЗаданий = Новый Массив;
//	
//
//		
//	Для Индекс = 1 По 3 Цикл
//		
//		ПараметрыЗадания = Новый Массив;
//		ПараметрыЗадания.Добавить(ИмяФайла);
//		ПараметрыЗадания.Добавить(Данные);
//		ПараметрыЗадания.Добавить(ПараметрыДоставки);
//		
//		Если Индекс = 2 Тогда
//			
//			ПараметрыЗадания = Новый Массив;
//			ПараметрыЗадания.Добавить(ИмяФайла);
//			ПараметрыЗадания.Добавить(Данные);
//			ПараметрыЗадания.Добавить(Новый Структура);
//			
//		КонецЕсли;
//		
//		ЗаданиеОтправкаФайла = ФоновыеЗадания.Выполнить("ПередачаДанных.ОтправитьФайл",
//											ПараметрыЗадания,
//											"Индекс" + Индекс,
//											"Тест.ПередачаДанных.ОтправитьФайл." + Индекс);
//											
//		МассивФоновыхЗаданий.Добавить(ЗаданиеОтправкаФайла);
//		
//	КонецЦикла;
//		
//	ФоновыеЗадания10 = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФоновыхЗаданий,10);


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
