#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_ПередатьДвоичныеДанныеВИБПриемник(Фреймворк) Экспорт
	


КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередачаДвоичныхДанных(ИмяФайла, Адрес, ПараметрыДоставки) Экспорт
	
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	
	ПередачаДанных.Доставить(ИмяФайла, Данные, ПараметрыДоставки);

КонецПроцедуры	

Функция КакТекст(Знач Ответ, Знач Кодировка = Неопределено) Экспорт
	
	Возврат КоннекторHTTP.КакТекст(Ответ, Кодировка);

КонецФункции

Функция КодироватьСтрокуURL(Знач Строка) Экспорт
	
	Возврат КодироватьСтроку(Строка, СпособКодированияСтроки.URLВКодировкеURL);

КонецФункции

#КонецОбласти
