#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды( ПараметрКоманды, ПараметрыВыполненияКоманды )
	
	КлючЗаписи = ПолучитьКлючЗаписи( ПараметрКоманды, ПараметрыВыполненияКоманды );
	
	Если ( КлючЗаписи = Неопределено ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура( "Ключ, ТолькоРедакторМаршрутов", КлючЗаписи, Истина );
	
	ОткрытьФорму( "РегистрСведений.ВнешниеЗапросы.Форма.ФормаЗаписи",
		ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьКлючЗаписи( ПараметрКоманды, ПараметрыВыполненияКоманды )
	
	Если ( ПараметрКоманды = ПредопределенноеЗначение("Перечисление.ИсточникКлючаЗаписи.ПолученныеЗапросы") ) Тогда
		
		Возврат ( ПараметрыВыполненияКоманды.Источник.Элементы.ПолученныеЗапросы.ТекущаяСтрока );
		
	Иначе
		
		ВызватьИсключение НСтр( "ru = 'Неизвестный источник ключа записи';en = 'Unknown record key source'" );
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
