//BSLLS-выкл.
#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_ДополнительныеДанные(Фреймворк) Экспорт
	
	Результат = Логирование.ДополнительныеДанные();
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 3);
	
КонецПроцедуры

// @unit-test
Процедура Тест_ЛогированиеТолькоСобытие(Фреймворк) Экспорт
	
	Логирование.Информация( "Информация1.Информация2.Информация3", "обушки-воробушки" );
	Логирование.Предупреждение( "Предупреждение1.Предупреждение2.Предупреждение3", "обушки-воробушки2" );
	Логирование.Ошибка( "Ошибка1.Ошибка2.Ошибка3", "обушки-воробушки3" );
	
	Тест_ОбщийМодульСервер.Пауза(3);
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "ОбработчикиСобытий.Информация1.Информация2.Информация3" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки", "Информация");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Предупреждение, "ОбработчикиСобытий.Предупреждение1.Предупреждение2.Предупреждение3" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки2", "Предупреждение");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Ошибка, "ОбработчикиСобытий.Ошибка1.Ошибка2.Ошибка3" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки3", "Ошибка");
	
КонецПроцедуры

// @unit-test
Процедура Тест_ЛогированиеСобытиеСОбъектом(Фреймворк) Экспорт
	
	НачатьТранзакцию();
	Попытка
		НовыйЭлемент = Справочники.ОбработчикиСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование = "ТестЛогирование";
		НовыйЭлемент.Записать();
		ДополнительныеДанные = Логирование.ДополнительныеДанные();
		ДополнительныеДанные.Объект = НовыйЭлемент;
		Логирование.Информация( "Информация11.Информация22.Информация33", "обушки-воробушки", ДополнительныеДанные );
		Логирование.Предупреждение( "Предупреждение11.Предупреждение22.Предупреждение33", "обушки-воробушки2", ДополнительныеДанные );
		Логирование.Ошибка( "Ошибка11.Ошибка22.Ошибка33", "обушки-воробушки3", ДополнительныеДанные );
		НовыйЭлемент.Удалить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Тест_ОбщийМодульСервер.Пауза(3);
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "ОбработчикиСобытий.Информация11.Информация22.Информация33" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].ПредставлениеМетаданных), "Информация");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Предупреждение, "ОбработчикиСобытий.Предупреждение11.Предупреждение22.Предупреждение33" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].ПредставлениеМетаданных), "Предупреждение");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Ошибка, "ОбработчикиСобытий.Ошибка11.Ошибка22.Ошибка33" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
	
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьЛожь(ПустаяСтрока(Результат[0].ПредставлениеМетаданных), "Ошибка");
	
КонецПроцедуры

// @unit-test
Процедура Тест_ЛогированиеСОбъектомИHTTPСервисОтвет200(Фреймворк) Экспорт
	
	ДополнительныеДанные1 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет1 = Новый HTTPСервисОтвет(200);
	ДополнительныеДанные1.HTTPСервисОтвет = HTTPСервисОтвет1;
	Логирование.Информация( "Информация111.Информация222.Информация333", "обушки-воробушки", ДополнительныеДанные1 );
	
	ДополнительныеДанные2 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет2 = Новый HTTPСервисОтвет(200);
	ДополнительныеДанные2.HTTPСервисОтвет = HTTPСервисОтвет2;
	Логирование.Предупреждение( "Предупреждение111.Предупреждение222.Предупреждение333", "обушки-воробушки2", ДополнительныеДанные2 );
	
	ДополнительныеДанные3 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет3 = Новый HTTPСервисОтвет(200);
	ДополнительныеДанные3.HTTPСервисОтвет = HTTPСервисОтвет3;
	Логирование.Ошибка( "Ошибка111.Ошибка222.Ошибка333", "обушки-воробушки3", ДополнительныеДанные3 );

	Тест_ОбщийМодульСервер.Пауза(3);
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "ОбработчикиСобытий.Информация111.Информация222.Информация333.200" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки", "Информация");
	
	Эталон = "{
		| ""type"": ""info"",
		| ""message"": ""обушки-воробушки""
		|}";	
	
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные1.HTTPСервисОтвет.КодСостояния, 200, "Информация");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные1.HTTPСервисОтвет.ПолучитьТелоКакСтроку(), Эталон, "Информация");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Предупреждение, "ОбработчикиСобытий.Предупреждение111.Предупреждение222.Предупреждение333.200" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки2", "Предупреждение");
	
	Эталон = "{
		| ""type"": ""warning"",
		| ""message"": ""обушки-воробушки2""
		|}";	

	Фреймворк.ПроверитьРавенство(ДополнительныеДанные2.HTTPСервисОтвет.КодСостояния, 200, "Предупреждение");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные2.HTTPСервисОтвет.ПолучитьТелоКакСтроку(), Эталон, "Предупреждение");

	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Ошибка, "ОбработчикиСобытий.Ошибка111.Ошибка222.Ошибка333.200" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки3", "Ошибка");
	
	Эталон = "{
		| ""type"": ""error"",
		| ""message"": ""обушки-воробушки3""
		|}";	

	Фреймворк.ПроверитьРавенство(ДополнительныеДанные3.HTTPСервисОтвет.КодСостояния, 200, "Ошибка");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные3.HTTPСервисОтвет.ПолучитьТелоКакСтроку(), Эталон, "Ошибка");
	
КонецПроцедуры

// @unit-test
Процедура Тест_ЛогированиеСОбъектомИHTTPСервисОтвет400(Фреймворк) Экспорт
	
	ДополнительныеДанные1 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет1 = Новый HTTPСервисОтвет(400);
	ДополнительныеДанные1.HTTPСервисОтвет = HTTPСервисОтвет1;
	Логирование.Информация( "Информация1111.Информация2222.Информация3333", "обушки-воробушки", ДополнительныеДанные1 );
	
	ДополнительныеДанные2 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет2 = Новый HTTPСервисОтвет(400);
	ДополнительныеДанные2.HTTPСервисОтвет = HTTPСервисОтвет2;
	Логирование.Предупреждение( "Предупреждение1111.Предупреждение2222.Предупреждение3333", "обушки-воробушки2", ДополнительныеДанные2 );
	
	ДополнительныеДанные3 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет3 = Новый HTTPСервисОтвет(400);
	ДополнительныеДанные3.HTTPСервисОтвет = HTTPСервисОтвет3;
	Логирование.Ошибка( "Ошибка1111.Ошибка2222.Ошибка3333", "обушки-воробушки3", ДополнительныеДанные3 );

	Тест_ОбщийМодульСервер.Пауза(3);
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "ОбработчикиСобытий.Информация1111.Информация2222.Информация3333.400" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Информация");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки", "Информация");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные1.HTTPСервисОтвет.КодСостояния, 400, "Информация");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ДополнительныеДанные1.HTTPСервисОтвет.ПолучитьТелоКакСтроку()), "Информация");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Предупреждение, "ОбработчикиСобытий.Предупреждение1111.Предупреждение2222.Предупреждение3333.400" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Предупреждение");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки2", "Предупреждение");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные2.HTTPСервисОтвет.КодСостояния, 400, "Предупреждение");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ДополнительныеДанные2.HTTPСервисОтвет.ПолучитьТелоКакСтроку()), "Предупреждение");

	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Ошибка, "ОбработчикиСобытий.Ошибка1111.Ошибка2222.Ошибка3333.400" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(Результат.Количество(), 1, "Ошибка");
	Фреймворк.ПроверитьРавенство(Результат[0].Комментарий, "обушки-воробушки3", "Ошибка");
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные3.HTTPСервисОтвет.КодСостояния, 400, "Ошибка");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ДополнительныеДанные3.HTTPСервисОтвет.ПолучитьТелоКакСтроку()), "Ошибка");

КонецПроцедуры

// @unit-test
Процедура Тест_ЛогированиеHTTPСервисОтветТелоОтвета(Фреймворк) Экспорт
	
	ДополнительныеДанные1 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет1 = Новый HTTPСервисОтвет(200);
	ДополнительныеДанные1.HTTPСервисОтвет = HTTPСервисОтвет1;
	Логирование.Информация( "Информация200.Информация200.Информация200", "обушки-воробушки", ДополнительныеДанные1 );
	
	ДополнительныеДанные2 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет2 = Новый HTTPСервисОтвет(400);
	ДополнительныеДанные2.HTTPСервисОтвет = HTTPСервисОтвет2;
	Логирование.Информация( "Информация400.Информация400.Информация400", "обушки-воробушки2", ДополнительныеДанные2 );
	
	ДополнительныеДанные3 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет3 = Новый HTTPСервисОтвет(403);
	ДополнительныеДанные3.HTTPСервисОтвет = HTTPСервисОтвет3;
	Логирование.Информация( "Информация403.Информация403.Информация403", "обушки-воробушки3", ДополнительныеДанные3 );

	ДополнительныеДанные4 = Логирование.ДополнительныеДанные();
	HTTPСервисОтвет4 = Новый HTTPСервисОтвет(423);
	ДополнительныеДанные4.HTTPСервисОтвет = HTTPСервисОтвет4;
	Логирование.Информация( "Информация423.Информация423.Информация423", "обушки-воробушки4", ДополнительныеДанные4 );

	Тест_ОбщийМодульСервер.Пауза(3);
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "Информация200.Информация200.Информация200.200" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные1.HTTPСервисОтвет.КодСостояния, 200, "Информация200");
	ТелоОтвета = ДополнительныеДанные1.HTTPСервисОтвет.ПолучитьТелоКакСтроку();
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация200");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки", "Информация200");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "Информация400.Информация400.Информация400.400" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные2.HTTPСервисОтвет.КодСостояния, 400, "Информация400");
	Фреймворк.ПроверитьИстину(ПустаяСтрока(ДополнительныеДанные2.HTTPСервисОтвет.ПолучитьТелоКакСтроку()), "Информация400");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "Информация403.Информация403.Информация403.403" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные3.HTTPСервисОтвет.КодСостояния, 403, "Информация403");
	ТелоОтвета = ДополнительныеДанные3.HTTPСервисОтвет.ПолучитьТелоКакСтроку();
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация403");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки3", "Информация403");
	
	Результат = Новый ТаблицаЗначений();
	ВыгрузитьЖурналРегистрации(Результат, 
		Новый Структура("ДатаНачала, Уровень, Событие",
			ТекущаяДата() - 30, УровеньЖурналаРегистрации.Информация, "Информация423.Информация423.Информация423.423" ),
		"Дата, ПредставлениеСобытия, ПредставлениеМетаданных, ПредставлениеДанных, Комментарий");
		
	Фреймворк.ПроверитьРавенство(ДополнительныеДанные4.HTTPСервисОтвет.КодСостояния, 423, "Информация423");
	ТелоОтвета = ДополнительныеДанные4.HTTPСервисОтвет.ПолучитьТелоКакСтроку();
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "info", "Информация423");
	Фреймворк.ПроверитьВхождение(ТелоОтвета, "обушки-воробушки4", "Информация423");
	
КонецПроцедуры	

#КонецОбласти