// @strict-types

#Область ПрограммныйИнтерфейс

// ПолучитьВерсиюКакОтветСервиса возвращает ответ HTTP-сервиса с номером версии конфигурации.
// 
// Параметры:
//  Запрос - HTTPСервисЗапрос - запрос к HTTP-сервису;
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ HTTP-сервиса с версией конфигурации;
//
Функция ПолучитьВерсиюКакОтветСервиса( Знач Запрос ) Экспорт
	
	Возврат СервисыHTTP.СоздатьОтветВФорматеJSON( ПолучитьВерсию() );
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВерсию()
	
	Результат = Новый Структура();
	Результат.Вставить( "version", Метаданные.Версия );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
