// @strict-types

#Область ПрограммныйИнтерфейс

// Конвертировать возвращает результат преобразования строки из одной заданной кодировки в другую заданную.
//
// Параметры:
// 	Текст - Строка - исходная строка;
//	ИзКодировки - Строка - кодировка, из которой выполняется преобразование;
// 	ВКодировку - Строка - кодировка, в которую выполняется преобразование;
//
// Возвращаемое значение:
// 	Строка - результат преобразования;
//
Функция Конвертировать (Знач Текст, Знач ИзКодировки, Знач ВКодировку = "UTF-8") Экспорт
	
//TODO дескрипторы, задача для делегирования (изучения инструментов) + тесты	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных( Поток, ИзКодировки );
	ЗаписьДанных.ЗаписатьСтроку( Текст );
	Поток.Перейти( 0, ПозицияВПотоке.Начало );
	ЧтениеДанных = Новый ЧтениеДанных( Поток, ВКодировку );

	Возврат ЧтениеДанных.ПрочитатьСтроку();
	
КонецФункции

#КонецОбласти
