
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УдаленыПомеченныеНаУдалениеЭлементы(Парам01)","УдаленыПомеченныеНаУдалениеЭлементы","Тогда удалены помеченные на удаление элементы ""ТестированиеДобавленияРедактированияУдаления""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УдаляютсяПомеченныеНаУдалениеЭлементы(Парам01)","УдаляютсяПомеченныеНаУдалениеЭлементы","Тогда удаляются помеченные на удаление элементы ""ТестированиеДобавленияРедактированияУдаления""","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Тогда удаляются помеченные на удаление элементы "ТестированиеДобавленияРедактированияУдаления"
//@УдаляютсяПомеченныеНаУдалениеЭлементы(Парам01)
Процедура УдаляютсяПомеченныеНаУдалениеЭлементы(Парам01) Экспорт
	УдаляютсяПомеченныеНаУдалениеЭлементыНаСервере(Парам01);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдаляютсяПомеченныеНаУдалениеЭлементыНаСервере(Знач Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Webhooks.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Webhooks КАК Webhooks
		|ГДЕ
		|	Webhooks.ПометкаУдаления
		|	И Webhooks.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Ссылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УдалитьОбъекты(Ссылки);
	
КонецПроцедуры

