#Область СлужебныйПрограммныйИнтерфейс

Функция ServicesGET( Запрос )
	
	Перем ОписаниеСервиса;
	Перем Ответ;
	
	Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().OK );
	
	ОписаниеСервиса = РаботаСИнтернетСервисами.ПолучитьОписаниеСервиса( "gitlab" );
	
	ТелоОтвета = Новый Структура();
	ТелоОтвета.Вставить( "version", Метаданные.Версия );
	ТелоОтвета.Вставить( "services", ОписаниеСервиса );
	
	Ответ.Заголовки.Вставить( "Content-Type", "application/json" );
	Ответ.УстановитьТелоИзСтроки( КоннекторHTTP.ОбъектВJson(ТелоОтвета) );
	
	Возврат Ответ;
	
КонецФункции

// TODO переделать

Функция WebhooksPOST(Запрос)
	
	Перем Ответ;
	Перем ОбработчикСобытий;
	Перем ДанныеТелаЗапроса;
	
	Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().BAD_REQUEST );
	
	ОбработчикСобытий = СервисыGitLab.НайтиОбработчикСобытияПоHTTPЗапросу(Запрос);
	
	Если ОбработчикСобытий = Неопределено Тогда
		
		Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().FORBIDDEN );
		Логирование.Ошибка("GitLab",
										 "ОбработкаЗапроса",
										 ОбработчикСобытий,
										 НСтр("ru = 'Секретный токен не найден.'"),
										 Ответ);
										 
		Возврат Ответ;
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ЗагружатьФайлыИзВнешнегоХранилища") Тогда
		
		Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().LOCKED );
		Логирование.Предупреждение("GitLab",
												 "ОбработкаЗапроса",
												 ОбработчикСобытий,
												 НСтр("ru = 'Функционал загрузки из внешнего хранилища отключен.'"),
												 Ответ);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	Ответ = Неопределено;
	СервисыGitLab.ПроверитьЗапросUpdates(ОбработчикСобытий, Запрос, Ответ);
	
	Если ( КодОтветаHTTP.isOk(Ответ.КодСостояния) ) Тогда
		
		ДанныеТелаЗапроса = Неопределено;
		СервисыGitLab.ПолучитьДанныеТелаЗапроса(ОбработчикСобытий, Запрос, Ответ, ДанныеТелаЗапроса);
		
	КонецЕсли;
	
	Если ( КодОтветаHTTP.isOk(Ответ.КодСостояния) ) Тогда
		
		СервисыGitLab.ПроверитьТелоЗапроса(ОбработчикСобытий, ДанныеТелаЗапроса, Ответ);
		
	КонецЕсли;
	
	Если ( КодОтветаHTTP.isOk(Ответ.КодСостояния) ) Тогда
		
		СервисыGitLab.ЗапуститьОбработкуДанныхВФоне(ОбработчикСобытий, ДанныеТелаЗапроса);
		
	КонецЕсли;
	
	Если ( КодОтветаHTTP.isOk(Ответ.КодСостояния) ) Тогда
		
		Логирование.Информация("GitLab",
											 "ОбработкаЗапроса.Окончание",
											 ОбработчикСобытий,
											 НСтр("ru = 'Запрос обработан.'"),
											 Ответ);
											 
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти