#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура ПерекодироватьСтроку(Фреймворк) Экспорт
	
	// given
	Эталон_UTF8 = "тестовая строка";
	Эталон_KOI8_R = "я┌п╣я│я┌п╬п╡п╟я▐ я│я┌я─п╬п╨п╟";
	// when
	Кодировка_KOI8_R = СтроковыеФункцииКлиентСервер.ПерекодироватьСтроку(Эталон_UTF8, "UTF-8", "KOI8-R");
	// then
	Фреймворк.ПроверитьРавенство(Кодировка_KOI8_R, Эталон_KOI8_R);
	// when
	Кодировка_UTF8 = СтроковыеФункцииКлиентСервер.ПерекодироватьСтроку(Кодировка_KOI8_R, "KOI8-R");
	// then
	Фреймворк.ПроверитьРавенство(Кодировка_UTF8, Эталон_UTF8);
	
КонецПроцедуры

#КонецОбласти