#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ОтобратьПоПрефиксуКлюча")
		.ДобавитьТест("ОтобратьПоПрефиксуКлючаБезФильтраВозвращаетПустойРезультат")
	;
	
КонецПроцедуры

Процедура ОтобратьПоПрефиксуКлюча() Экспорт
	
	// given
	Префикс = ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока();
	Ключ = Префикс + "|...";
	
	ФоновыеЗадания.Выполнить( "ОМ_Фоновые.Заглушка", , ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока() );
	ФоновыеЗадания.Выполнить( "ОМ_Фоновые.Заглушка", , Ключ );
	ФоновыеЗадания.Выполнить( "ОМ_Фоновые.Заглушка", , ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока() + Префикс );
	
	// when
	Результат = Фоновые.ОтобратьПоПрефиксуКлюча(Новый Структура("ИмяМетода", "ОМ_Фоновые.Заглушка"), Префикс);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(1)
		.Свойство("[0].Ключ").Равно(Ключ);

КонецПроцедуры

Процедура ОтобратьПоПрефиксуКлючаБезФильтраВозвращаетПустойРезультат() Экспорт
	
	// given
	
	// when
	Результат = Фоновые.ОтобратьПоПрефиксуКлюча(Неопределено, "");
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.НеЗаполнено();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Заглушка(Знач Ожидание = 5) Экспорт
	
	ОМ_Тесты.ЮТест().Пауза(Ожидание);
	
КонецПроцедуры

#КонецОбласти
