// @strict-types

#Область ПрограммныйИнтерфейс

// НастройкиСервисаОбработкиЗапросаГитлаб возвращает инициализрованный по умолчанию набор настроек для
// сервиса обработки запроса с сервера Gitlab.
// 
// Возвращаемое значение:
// 	Структура - набор параметров:
// * ОбрабатыватьГитлабЗапрос - Булево - Истина - обрабатывать запросы с сервера GitLab, иначе - Ложь;
// * ИмяФайлаСхемыМаршрута - см. НастройкиСервисов.ПолучитьИмяФайлаСхемыМаршрута
// * ТокенГитлаб - см. НастройкиСервисов.ПолучитьТокенГитлаб
// * ТаймаутГитлаб - см. НастройкиСервисов.ПолучитьТаймаутГитлаб
// * ПользовательВнешнегоСервиса - см. НастройкиСервисов.ПолучитьПользователяВнешнегоСервиса
// * ПарольВнешнегоСервиса - см. НастройкиСервисов.ПолучитьПарольВнешнегоСервиса
// * ТаймаутВнешнегоСервиса - см. НастройкиСервисов.ПолучитьТаймаутВнешнегоСервиса
// 
Функция НастройкиСервисаОбработкиЗапросаГитлаб() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить( "ОбрабатыватьГитлабЗапрос", Ложь );
	Результат.Вставить( "ИмяФайлаСхемыМаршрута", "" );
	Результат.Вставить( "ТокенГитлаб", "" );
	Результат.Вставить( "ТаймаутГитлаб", 0 );
	Результат.Вставить( "ПользовательВнешнегоСервиса", "" );
	Результат.Вставить( "ПарольВнешнегоСервиса", "" );
	Результат.Вставить( "ТаймаутВнешнегоСервиса", 0 );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
