// @strict-types

#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. НастройкиСервисаОбработкиЗапросаГитлаб возвращает набор настроек для
// сервиса обработки запроса с сервера Gitlab.
// 
// Возвращаемое значение:
// 	Структура - набор параметров:
// * ОбрабатыватьГитлабЗапрос - Булево - Истина - обрабатывать запросы с сервера GitLab, иначе - Ложь;
// * ИмяФайлаСхемыМаршрута - см. НастройкиСервисов.ПолучитьИмяФайлаСхемыМаршрута
// * ТокенГитлаб - см. НастройкиСервисов.ПолучитьТокенГитлаб
// * ТаймаутГитлаб - см. НастройкиСервисов.ПолучитьТаймаутГитлаб
// 
Функция НастройкиСервисаОбработкиЗапросаГитлаб() Экспорт
	
	ТАЙМАУТ_ПО_УМОЛЧАНИЮ = 5;
	
	Результат = Новый Структура();
	Результат.Вставить( "ОбрабатыватьГитлабЗапрос", Ложь );
	Результат.Вставить( "ИмяФайлаСхемыМаршрута", "" );
	Результат.Вставить( "ТокенГитлаб", "" );
	Результат.Вставить( "ТаймаутГитлаб", ТАЙМАУТ_ПО_УМОЛЧАНИЮ );
	
	Возврат Результат;
	
КонецФункции

// Устарела. НастройкиПараметровСоединенияКПолучателямПоУмолчанию возвращает набор настроек параметров соединения
// к сервисам информационной базы получателя по умолчанию.
// 
// Возвращаемое значение:
// 	Структура - набор параметров:
// * ПользовательВнешнегоСервиса - Строка - имя пользователя (макс. 256 символов);
// * ПарольВнешнегоСервиса - Строка - пароль (макс. 256 символов);
// * ТаймаутВнешнегоСервиса - Число - таймаут соединения, сек (0 - таймаут не установлен), по умолчанию = 5;
// 
Функция НастройкиПараметровСоединенияКПолучателямПоУмолчанию() Экспорт
	
	ТАЙМАУТ_ПО_УМОЛЧАНИЮ = 5;
	
	Результат = Новый Структура();
	Результат.Вставить( "ПользовательВнешнегоСервиса", "" );
	Результат.Вставить( "ПарольВнешнегоСервиса", "" );
	Результат.Вставить( "ТаймаутВнешнегоСервиса", ТАЙМАУТ_ПО_УМОЛЧАНИЮ );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
