// @strict-types

#Область ПрограммныйИнтерфейс

// ПараметрыСоединения возвращает параметры соединения к сервисам информационной базы получателя.
// 
// Возвращаемое значение:
// Структура - параметры подключения:
// * Адрес - Строка - URL ресурса, к которому будет отправлен запрос;
// * Пользователь - Строка - имя пользователя;
// * Пароль - Строка - пароль;
// * Таймаут - Число - таймаут соединения, сек (0 - таймаут не установлен), по умолчанию = 5;
//
Функция ПараметрыСоединения() Экспорт
	
	ТАЙМАУТ_ПО_УМОЛЧАНИЮ = 5;
	
	Результат = Новый Структура();
	Результат.Вставить( "Адрес", "" );
	Результат.Вставить( "Пользователь", "" );
	Результат.Вставить( "Пароль", "" );
	Результат.Вставить( "Таймаут", ТАЙМАУТ_ПО_УМОЛЧАНИЮ );
	
	Возврат Результат;
	
КонецФункции

// ПолучитьПолныйПутьКСервису возвращает полный путь к сервису на основании данных получателя.
//
// Параметры:
//  Данные	- СправочникОбъект.Получатели, ДанныеФормыСтруктура - источник данных, содержащий поля:
//  		* АдресИнформационнойБазы - Строка
//  		* ПутьКСервисам - Строка
//  		* ПутьКСтатусуСервиса - Строка
//  		* ПутьКЗагрузкеФайла - Строка
//  ИмяПоля - Строка - имя поля содержащее относительный путь к сервису, значение которого добавляется к базовому пути;
//
// Возвращаемое значение:
//  Строка - полный путь к сервису;
//
Функция ПолучитьПолныйПутьКСервису( Знач Данные, Знач ИмяПоля ) Экспорт

	Возврат Данные.АдресИнформационнойБазы + Данные.ПутьКСервисам + Данные[ ИмяПоля ];

КонецФункции

#КонецОбласти
