// @strict-types

#Область ПрограммныйИнтерфейс

// TODO проработать описание, непонятны некоторые значения

// ПараметрыСоединения возвращает параметры подключения к конечной точке веб-сервиса получателя.
// 
// Возвращаемое значение:
// Структура - параметры подключения:
// * URL - Строка - direct service operation URL; // TODO ващеее не помню что это
// * BaseURL - Строка - адрес к опубликованной на веб-сервере базе получателя, например, http://host/ib;
// * RootURL - Строка - относительный путь к группе сервисов загрузки файла, например, /hs/epf,
//						см. https://app.swaggerhub.com/apis-docs/astrizhachuk/epf-endpoint;
// * StatusOperation - Строка - относительный по отношению к RootURL путь к сервису проверки статуса операции;
// * UploadFileOperation - Строка - относительный по отношению к RootURL путь к сервису загрузки файла;
// * UseGlobalSettings - Булево - установка приоритета глобальных настроек подключения;
// * Пользователь - Строка - имя пользователя;
// * Пароль - Строка - пароль;
// * Таймаут - Число - таймаут соединения, сек (0 - таймаут не установлен);
//
Функция ПараметрыСоединения() Экспорт
	
	ТАЙМАУТ_ПО_УМОЛЧАНИЮ = 5;
	
	Результат = Новый Структура();
	Результат.Вставить( "URL", "" );
	Результат.Вставить( "BaseURL", "" );
	Результат.Вставить( "RootURL", "" );
	Результат.Вставить( "StatusOperation", "/status" );
	Результат.Вставить( "UploadFileOperation", "/uploadFile" );
	Результат.Вставить( "UseGlobalSettings", Ложь );
	Результат.Вставить( "Пользователь", "" );
	Результат.Вставить( "Пароль", "" );
	Результат.Вставить( "Таймаут", ТАЙМАУТ_ПО_УМОЛЧАНИЮ );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
