#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ПолучитьКраткийИдентификатор")
			.СПараметрами("a1b2c3d4e5f6g7h8i9j0", 8, "a1b2c3d4")
			.СПараметрами("a1b2c3", 8, "a1b2c3")
			.СПараметрами("a1b2c3d4e5f6g7h8i9j0", 0, "")
			.СПараметрами("1234567890abcdef", 8, "12345678")
			.СПараметрами("", 8, "")
	;
	
КонецПроцедуры

Процедура ПолучитьКраткийИдентификатор(Знач Идентификатор, Знач Длина, Знач ОжидаемыйРезультат) Экспорт
	
	// given
	ПараметрыСеанса.ДлинаХэшаКоммита = Длина;
	
	// when
	Результат = СистемаУправленияВерсиями.ПолучитьКраткийИдентификатор(Идентификатор);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

#КонецОбласти
