#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ПараметрыСоединения")
	;
	
КонецПроцедуры

Процедура ПараметрыСоединения() Экспорт
	
	// given
	Ожидание = Заглушка();
	
	// when
	Результат = ПолучателиКлиентСервер.ПараметрыСоединения();
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.ИмеетДлину(Ожидание.Количество())
		.ИмеетСвойстваРавные(Ожидание);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Заглушка()
	
	Результат = Новый Структура();
	Результат.Вставить("URL", "");
	Результат.Вставить("BaseURL", "");
	Результат.Вставить("RootURL", "");
	Результат.Вставить("StatusOperation", "/status");
	Результат.Вставить("UploadFileOperation", "/uploadFile");
	Результат.Вставить("UseGlobalSettings", Ложь);
	Результат.Вставить("Пользователь", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("Таймаут", 5);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
