#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("ФайлИзХранилища")
		.ДобавитьТест("ФайлДляОтправки")
	;
	
КонецПроцедуры

Процедура ФайлИзХранилища() Экспорт
	
	// given
	
	// when
	Результат = ФайловыеМодели.ФайлИзХранилища();
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.ИмеетДлину(8)
		.Свойство("Идентификатор")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("ИмяФайла")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("ДвоичныеДанные")
			.ЭтоНеопределено()
		.Свойство("Дата")
			.ИмеетТип("Дата")
			.Равно(Дата(1, 1, 1))
		.Свойство("Действие")
			.ИмеетТип("ПеречислениеСсылка.ВидыИзмененийФайла")
			.Равно(Перечисления.ВидыИзмененийФайла.ПустаяСсылка())
		.Свойство("ПутьКФайлу")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("RAWFilePath")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("ИнформацияОбОшибке")
			.ЭтоНеопределено();
			
КонецПроцедуры

Процедура ФайлДляОтправки() Экспорт
	
	// given
	
	// when
	Результат = ФайловыеМодели.ФайлДляОтправки();
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.ИмеетДлину(4)
		.Свойство("Идентификатор")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("ИмяФайла")
			.ИмеетТип("Строка")
			.НеЗаполнено()
		.Свойство("ДвоичныеДанные")
			.ЭтоНеопределено()
		.Свойство("Маршруты")
			.ИмеетТип("Массив")
			.НеЗаполнено();
	
КонецПроцедуры

#КонецОбласти
