#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПолучитьФайл(Фреймворк) Экспорт

	//https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20	
	//URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("АдресGitlab");
	URL = "http://gitlab";
	//GitLabUserPrivateToken = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("GitLabUserPrivateToken");
	GitLabUserPrivateToken = "-U2ssrBsM4rmx85HXzZ1";
	ПутьКФайлу = КодироватьСтроку(	"Каталог с отчетами и обработками/Внешняя Обработка 1.epf",
									СпособКодированияСтроки.КодировкаURL );
	commit = "ef3529e5486ff39c6439ab5d745eb56588202b86";
	ПутьКФайлу = СтрШаблон("/api/v4/projects/1/repository/files/%1/raw?ref=%2", ПутьКФайлу, commit);

	// ошибка, неверный URL
	Результат = Gitlab.ПолучитьФайл("http://фэйк", ПутьКФайлу, GitLabUserPrivateToken, 5);
	Фреймворк.ПроверитьНеРавенство(Результат.Ошибка, Неопределено);
	
	// ошибка, нет файла
	Результат = Gitlab.ПолучитьФайл(URL, "/фэйк.epf", GitLabUserPrivateToken, 5);
	Фреймворк.ПроверитьНеРавенство(Результат.Ошибка, Неопределено);
	
	// 200
	Результат = Gitlab.ПолучитьФайл(URL, ПутьКФайлу, GitLabUserPrivateToken, 5);
	Фреймворк.ПроверитьТип(Результат, "Структура");
	Фреймворк.ПроверитьРавенство(Результат.ИмяФайлаИзЗапроса, "Внешняя Обработка 1.epf");
	FromWin1251 = СтроковыеФункцииКлиентСервер.ПерекодироватьСтроку("Внешняя Обработка 1.epf", "windows-1251");
	Фреймворк.ПроверитьРавенство(Результат.ИмяФайла, FromWin1251);
	Фреймворк.ПроверитьТип(Результат.Данные, "ДвоичныеДанные");
	Фреймворк.ПроверитьРавенство(Результат.Ошибка, Неопределено);

КонецПроцедуры

// @unit-test:dev
// Параметры:
// 	Фреймворк - ФреймворкТестирования - Фреймворк тестирования
Процедура ПутьКФайлуRAW(Фреймворк) Экспорт
	
	Эталон = "/api/v4/projects/1/repository/files/%D0%B0%2F%D0%B1%2F%D0%B2/raw?ref=0123456789";
	Результат = Gitlab.ПутьКФайлуRAW(1, "а/б/в", "0123456789");
	Фреймворк.ПроверитьРавенство(Результат, Эталон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
