
&Вместо("Get")
Функция Мок_Get(URL, ПараметрыЗапроса, ДополнительныеПараметры, Сессия) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(URL, ПараметрыЗапроса, ДополнительныеПараметры, Сессия);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(КоннекторHTTP, "Get", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(URL, ПараметрыЗапроса, ДополнительныеПараметры, Сессия);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции

&Вместо("Post")
Функция Мок_Post(URL, Данные, ДополнительныеПараметры, Сессия) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(URL, Данные, ДополнительныеПараметры, Сессия);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(КоннекторHTTP, "Post", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(URL, Данные, ДополнительныеПараметры, Сессия);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
