
&Вместо("РаспределитьФайлыПоМаршрутам")
Функция Мок_РаспределитьФайлыПоМаршрутам(Знач Обработчик, Знач Идентификатор, Знач Схемы, Знач Файлы) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор, Схемы, Файлы);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(Маршрутизация, "РаспределитьФайлыПоМаршрутам", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Обработчик, Идентификатор, Схемы, Файлы);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
