// @strict-types

#Область ПрограммныйИнтерфейс

// ПолучитьРеквизитыАутентификации возвращает учетные данные подключения к внешнему источнику данных
// по данным обработчиков внешних запросов.
// 
// Параметры:
// 	АдресПроекта - Строка - адрес проекта (URL);
// 	
// Возвращаемое значение:
// - Неопределено - данные не найдены;
// - Структура - учетные данные:
//	* Обработчик - СправочникСсылка.ОбработчикиВнешнихЗапросов - обработчик внешних запросов;
//	* Токен - Строка - токен внешнего хранилища; 
//
Функция ПолучитьРеквизитыАутентификации( Знач АдресПроекта ) Экспорт

	Обработчики = Справочники.ОбработчикиВнешнихЗапросов.НайтиПоАдресуПроекта( АдресПроекта );
	
	Если ( НЕ ЗначениеЗаполнено(Обработчики) ) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ( Обработчики.Количество() > 1 ) Тогда
		
		ВызватьИсключение Логи.Сообщения().DUPLICATE_PROJECTS;
		
	КонецЕсли;
	
	// TODO разобраться с типизацией
	Возврат Обработчики.Получить(0);

КонецФункции

#КонецОбласти
