#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	//@skip-check undefined-variable
	ЮТТесты
		.ДобавитьТест("НайтиПоАдресуПубликации")
			.ВТранзакции()
		.ДобавитьТест("НайтиПоАдресуПубликацииПриПомеченномНаУдалениеОбъектеВозвращаетПустоеЗначение")
			.ВТранзакции()
		.ДобавитьТест("НайтиПоАдресуПубликацииПриНеверномТипеПараметраВозвращаетПустоеЗначение")
			.СПараметрами(1)
			.СПараметрами(Неопределено)
		.ДобавитьТест("НайтиПоАдресуПубликацииПриПустомПараметреВозвращаетПустоеЗначение")
			.ВТранзакции()
	;
	
КонецПроцедуры

Процедура НайтиПоАдресуПубликации() Экспорт
	
	// given
	Адрес = ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока(); 
	
	Конструктор = ОМ_Тесты.ЮТест().Данные().КонструкторОбъекта(Справочники.Получатели);
	Ожидание = Конструктор
					.ФикцияОбязательныхПолей()
					.Установить("BaseURL", Адрес)
					.Записать( , Истина);
	
	// when
	Результат = Справочники.Получатели.НайтиПоАдресуПубликации(Адрес);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(1)
		.Свойство("[0]").Равно(Ожидание.Ссылка);
	
КонецПроцедуры

Процедура НайтиПоАдресуПубликацииПриПомеченномНаУдалениеОбъектеВозвращаетПустоеЗначение() Экспорт
	
	// given
	Адрес = ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока(); 
	
	Конструктор = ОМ_Тесты.ЮТест().Данные().КонструкторОбъекта(Справочники.Получатели);
	Конструктор
		.ФикцияОбязательныхПолей()
		.Установить("BaseURL", Адрес)
		.Установить("ПометкаУдаления", Истина)
		.Записать( , Истина);
	
	// when
	Результат = Справочники.Получатели.НайтиПоАдресуПубликации(Адрес);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.НеЗаполнено()
	
КонецПроцедуры

Процедура НайтиПоАдресуПубликацииПриНеверномТипеПараметраВозвращаетПустоеЗначение(Знач Параметр) Экспорт
	
	// given
	
	// when
	Результат = Справочники.Получатели.НайтиПоАдресуПубликации(Параметр);
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.НеЗаполнено()
	
КонецПроцедуры

Процедура НайтиПоАдресуПубликацииПриПустомПараметреВозвращаетПустоеЗначение() Экспорт
	
	// given
	Конструктор = ОМ_Тесты.ЮТест().Данные().КонструкторОбъекта(Справочники.Получатели);
	Конструктор
		.ФикцияОбязательныхПолей()
		.Записать();
	
	// when
	Результат = Справочники.Получатели.НайтиПоАдресуПубликации("");
	
	// then
	ОМ_Тесты.ЮТест().ОжидаетЧто(Результат)
		.ИмеетТип("Массив")
		.НеЗаполнено()
	
КонецПроцедуры

#КонецОбласти
