// @unit-test
Процедура Тест_НайтиОбработчикСобытияПоHTTPЗапросу(Фреймворк) Экспорт
	
	Фреймворк.Что(СервисыGitLab.НайтиОбработчикСобытияПоHTTPЗапросу(1)).ЭтоНеопределено();
	Фреймворк.Что(СервисыGitLab.НайтиОбработчикСобытияПоHTTPЗапросу(Неопределено)).ЭтоНеопределено();

	НачатьТранзакцию();
	
	Попытка

		СекретныйТокен = "блаблаблаюниттест";
		НовыйЭлемент = Тест_ОбщийМодульСервер.ДобавитьОбработчикСобытий("ЮнитТест1", СекретныйТокен);
		НовыйЭлемент = Тест_ОбщийМодульСервер.ДобавитьОбработчикСобытий("ЮнитТест2", СекретныйТокен);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("X-Gitlab-Event", "Push Hook");
		Заголовки.Вставить("X-Gitlab-Token", СекретныйТокен);
	
		HTTPЗапрос = Новый HTTPЗапрос("localhost", Заголовки);
		
		Фреймворк.Что(СервисыGitLab.НайтиОбработчикСобытияПоHTTPЗапросу(HTTPЗапрос).Ссылка).Равно(НовыйЭлемент.Ссылка);
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры