Подключить ();
ЗакрытьВсе ();

// Вводим новый документ
Коммандос ( "e1cib/data/Справочник.Webhooks" );
Здесь ();
Нажать ("!ФормаЗаписатьИЗакрыть");
Если ( НайтиСообщения ( "Поле*" ).Количество () = 0 ) Тогда
	Стоп ( "Должна быть ошибка пустого значения в поле" );
КонецЕсли;

Установить ( "!Наименование", "dev1" );

Нажать ( "!ФормаЗаписатьИЗакрыть" );
Если ( НайтиСообщения ( "Поле*" ).Количество () > 0 ) Тогда
	Стоп ( "Не должно быть ошибок пустого значения в поле" );
КонецЕсли;