#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:fast
Процедура Тест_СервисПолучателяДоступен(Фреймворк) Экспорт

	//https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20	
	//URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	URL = "http://172.23.0.4/api/hs/gitlab";
	
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPGet(URL + "/version");
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	ТелоОтвета = Тест_ПередачаДанныхСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """message""");

КонецПроцедуры

// @unit-test:fast
Процедура Тест_ПередачаДвоичныхДанных(Фреймворк) Экспорт
	
	//https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20	
	//URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	URL = "http://172.23.0.4/api/hs/gitlab";
	
	//Token = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("AccessTokenReceiver");
	Token = "12345678901234567890";
	
	Результат = ВключитьЗагрузкуФайловНаПолучателе(URL, Token);
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	ТелоОтвета = Тест_ПередачаДанныхСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """Включено.""");
	
	// Ошибка в параметрах (нет параметров доставки)
	ИмяФайла = "ВнешняяОбработка1.epf";
	ПараметрыДоставки = Новый Структура;
	
	//https://github.com/DoublesunRUS/ru.capralow.dt.unit.launcher/issues/20
	//КаталогПроекта = Фреймворк.Объект.КаталогПроекта;
	КаталогПроекта = "C:\w\1c\workspace\gitlab-services";
	Адрес = "";
	ПоместитьФайл(Адрес, КаталогПроекта + "\test\receiver\Внешняя Обработка 2.epf", , Ложь);

	Попытка
		Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки);
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	Исключение

	КонецПопытки;
	
	// Успешная передача данных
	Адрес = "";
	ПоместитьФайл(Адрес, КаталогПроекта + "\test\receiver\Внешняя Обработка 2.epf", , Ложь);
	
	ПараметрыДоставки.Вставить("АдресДоставки", URL + "/update");
	ПараметрыДоставки.Вставить("Token", Token);
	ПараметрыДоставки.Вставить("Таймаут", 5);
	
	Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВключитьЗагрузкуФайловНаПолучателе(Знач URL, Знач Token)
		
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Value", "true");
	Заголовки.Вставить("Token", Token);
	ДополнительныеПараметры  = Новый Структура;
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);

	Возврат Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL + "/switch", , ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти