#Область СлужебныйПрограммныйИнтерфейс





#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ВключитьЗагрузкуФайловНаПолучателе(Знач URL, Знач Token)
//		
//	Заголовки  = Новый Соответствие;
//	Заголовки.Вставить("Value", "true");
//	Заголовки.Вставить("Token", Token);
//	ДополнительныеПараметры  = Новый Структура;
//	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);
//
//	Возврат Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL + "/switch", , ДополнительныеПараметры);
//	
//КонецФункции

#КонецОбласти