#Область СлужебныйПрограммныйИнтерфейс

// @unit-test:fast
Процедура Тест_СервисПолучателяДоступен(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	
	Результат = Тест_HTTPСервисыСервер.КоннекторHTTPGet(URL + "/version");
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	
	ТелоОтвета = Тест_ПередачаДанныхСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """message""");

КонецПроцедуры

// @unit-test:fast
Процедура Тест_ПередачаДвоичныхДанных(Фреймворк) Экспорт
	
	URL = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("МестоположениеСервисаИБПолучателя_1");
	Token = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("AccessTokenReceiver");
	
	Результат = ВключитьЗагрузкуФайловНаПолучателе(URL, Token);
	Фреймворк.ПроверитьРавенство(Результат.КодСостояния, 200);
	ТелоОтвета = Тест_ПередачаДанныхСервер.КакТекст(Результат, КодировкаТекста.UTF8);
	Фреймворк.ПроверитьВхождение(ТелоОтвета, """Включено.""");
	
	// Ошибка в параметрах (нет параметров доставки)
	ИмяФайла = "ВнешняяОбработка1.epf";
	ПараметрыДоставки = Новый Структура;
	
	Адрес = "";
	ПоместитьФайл(Адрес, Фреймворк.Объект.КаталогПроекта + "\test\receiver\Внешняя Обработка 2.epf", , Ложь);

	Попытка
		Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки);
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	Исключение

	КонецПопытки;
	
	// Успешная передача данных
	Адрес = "";
	ПоместитьФайл(Адрес, Фреймворк.Объект.КаталогПроекта + "\test\receiver\Внешняя Обработка 2.epf", , Ложь);
	
	ПараметрыДоставки.Вставить("ТочкаДоставки", URL + "/update");
	ПараметрыДоставки.Вставить("Token", Token);
	ПараметрыДоставки.Вставить("Таймаут", 5);
	
	Тест_ПередачаДанныхСервер.ОднократнаяПередачаДанных(ИмяФайла, Адрес, ПараметрыДоставки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВключитьЗагрузкуФайловНаПолучателе(Знач URL, Знач Token)
		
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Value", "true");
	Заголовки.Вставить("Token", Token);
	ДополнительныеПараметры  = Новый Структура;
	ДополнительныеПараметры.Вставить("Заголовки", Заголовки);

	Возврат Тест_HTTPСервисыСервер.КоннекторHTTPPost(URL + "/switch", , ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти