
&Вместо("Восстановить")
Функция Мок_Восстановить(Знач Обработчик, Знач Идентификатор) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(ФайлыВнешнегоХранилища, "Восстановить", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Обработчик, Идентификатор);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции

&Вместо("ПолучитьИзХранилища")
Функция Мок_ПолучитьИзХранилища(Знач ОписаниеФайлов, Знач Параметры) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(ОписаниеФайлов, Параметры);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(ФайлыВнешнегоХранилища, "ПолучитьИзХранилища", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(ОписаниеФайлов, Параметры);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
