#Region Internal

// @unit-test
Процедура ПараметрыПолучателя(Фреймворк) Экспорт

	НачатьТранзакцию();	
	Попытка
		// given
		Константы.TokenReceiver.Установить("998");
		Константы.TimeoutDeliveryFile.Установить(999);
		// when
		Результат = НастройкаСервисов.ПараметрыПолучателя();
		// then
		Фреймворк.ПроверитьРавенство(Результат.Количество(), 3);
		Фреймворк.ПроверитьРавенство(Результат.Адрес, "localhost/receiver/hs/gitlab");
		Фреймворк.ПроверитьРавенство(Результат.Token, "998");
		Фреймворк.ПроверитьРавенство(Результат.Таймаут, 999);		

		ОтменитьТранзакцию();					
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// @unit-test
Процедура ПараметрыПолучателяОтрицательныйТаймаутДоставкиФайла(Фреймворк) Экспорт

	НачатьТранзакцию();	
	Попытка
		// given
		Константы.TokenReceiver.Установить("998");
		Константы.TimeoutDeliveryFile.Установить(999);
		// when
		Результат = НастройкаСервисов.ПараметрыПолучателя();
		// then
		Фреймворк.ПроверитьРавенство(Результат.Количество(), 3);
		Фреймворк.ПроверитьРавенство(Результат.Адрес, "localhost/receiver/hs/gitlab");
		Фреймворк.ПроверитьРавенство(Результат.Token, "998");
		Константы.TimeoutDeliveryFile.Установить(-5);
		Результат = НастройкаСервисов.ПараметрыПолучателя();
		Фреймворк.ПроверитьРавенство(Результат.Таймаут, 0);

		ОтменитьТранзакцию();					
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// @unit-test
Процедура CurrentSettings(Фреймворк) Экспорт

	НачатьТранзакцию();	
	Попытка
		// given		
		Константы.HandleRequests.Установить(Истина);
		Константы.RoutingFileName.Установить("ИмяФайла.json");
		Константы.TokenGitLab.Установить("TokenGitLab");
		Константы.TimeoutGitLab.Установить(998);
		Константы.TokenReceiver.Установить("TokenReceiver");
		Константы.TimeoutDeliveryFile.Установить(999);
		// when
		Результат = НастройкаСервисов.CurrentSettings();
		// then
		Фреймворк.ПроверитьТип(Результат, "ФиксированнаяСтруктура");
		Фреймворк.ПроверитьРавенство(Результат.Количество(), 6);
		Фреймворк.ПроверитьИстину(Результат.IsHandleRequests);
		Фреймворк.ПроверитьРавенство(Результат.RoutingFileName, "ИмяФайла.json");
		Фреймворк.ПроверитьРавенство(Результат.TokenGitLab, "TokenGitLab");		
		Фреймворк.ПроверитьРавенство(Результат.TimeoutGitLab, 998);		
		Фреймворк.ПроверитьРавенство(Результат.TokenReceiver, "TokenReceiver");
		Фреймворк.ПроверитьРавенство(Результат.TimeoutDeliveryFile, 999);		
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#EndRegion
